apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_EXTMEM_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_EXTMEM_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* EXTMEM_DCACHE_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_CTRL_REG (DR_REG_EXTMEM_BASE + 0x0)

/* EXTMEM_DCACHE_BLOCKSIZE_MODE : R/W; bitpos: [4:3]; default: 0;
 * The bit is used to configure cache block size.0: 16 bytes, 1: 32 bytes,2:
 * 64 bytes
 */

#define EXTMEM_DCACHE_BLOCKSIZE_MODE    0x00000003
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_M  (EXTMEM_DCACHE_BLOCKSIZE_MODE_V << EXTMEM_DCACHE_BLOCKSIZE_MODE_S)
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_V  0x00000003
#define EXTMEM_DCACHE_BLOCKSIZE_MODE_S  3

/* EXTMEM_DCACHE_SIZE_MODE : R/W; bitpos: [2]; default: 0;
 * The bit is used to configure cache memory size.0: 32KB, 1: 64KB
 */

#define EXTMEM_DCACHE_SIZE_MODE    (BIT(2))
#define EXTMEM_DCACHE_SIZE_MODE_M  (EXTMEM_DCACHE_SIZE_MODE_V << EXTMEM_DCACHE_SIZE_MODE_S)
#define EXTMEM_DCACHE_SIZE_MODE_V  0x00000001
#define EXTMEM_DCACHE_SIZE_MODE_S  2

/* EXTMEM_DCACHE_ENABLE : R/W; bitpos: [0]; default: 0;
 * The bit is used to activate the data cache. 0: disable, 1: enable
 */

#define EXTMEM_DCACHE_ENABLE    (BIT(0))
#define EXTMEM_DCACHE_ENABLE_M  (EXTMEM_DCACHE_ENABLE_V << EXTMEM_DCACHE_ENABLE_S)
#define EXTMEM_DCACHE_ENABLE_V  0x00000001
#define EXTMEM_DCACHE_ENABLE_S  0

/* EXTMEM_DCACHE_CTRL1_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_CTRL1_REG (DR_REG_EXTMEM_BASE + 0x4)

/* EXTMEM_DCACHE_SHUT_CORE1_BUS : R/W; bitpos: [1]; default: 1;
 * The bit is used to disable core1 dbus, 0: enable, 1: disable
 */

#define EXTMEM_DCACHE_SHUT_CORE1_BUS    (BIT(1))
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_M  (EXTMEM_DCACHE_SHUT_CORE1_BUS_V << EXTMEM_DCACHE_SHUT_CORE1_BUS_S)
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_V  0x00000001
#define EXTMEM_DCACHE_SHUT_CORE1_BUS_S  1

/* EXTMEM_DCACHE_SHUT_CORE0_BUS : R/W; bitpos: [0]; default: 1;
 * The bit is used to disable core0 dbus, 0: enable, 1: disable
 */

#define EXTMEM_DCACHE_SHUT_CORE0_BUS    (BIT(0))
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_M  (EXTMEM_DCACHE_SHUT_CORE0_BUS_V << EXTMEM_DCACHE_SHUT_CORE0_BUS_S)
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_V  0x00000001
#define EXTMEM_DCACHE_SHUT_CORE0_BUS_S  0

/* EXTMEM_DCACHE_TAG_POWER_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_TAG_POWER_CTRL_REG (DR_REG_EXTMEM_BASE + 0x8)

/* EXTMEM_DCACHE_TAG_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 * The bit is used to power dcache tag memory up, 0: follow  rtc_lslp_pd, 1:
 * power up
 */

#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU    (BIT(2))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_M  (EXTMEM_DCACHE_TAG_MEM_FORCE_PU_V << EXTMEM_DCACHE_TAG_MEM_FORCE_PU_S)
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_V  0x00000001
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PU_S  2

/* EXTMEM_DCACHE_TAG_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 * The bit is used to power dcache tag memory down, 0: follow  rtc_lslp_pd,
 * 1: power down
 */

#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD    (BIT(1))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_M  (EXTMEM_DCACHE_TAG_MEM_FORCE_PD_V << EXTMEM_DCACHE_TAG_MEM_FORCE_PD_S)
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_V  0x00000001
#define EXTMEM_DCACHE_TAG_MEM_FORCE_PD_S  1

/* EXTMEM_DCACHE_TAG_MEM_FORCE_ON : R/W; bitpos: [0]; default: 1;
 * The bit is used to close clock gating of dcache tag memory. 1: close
 * gating, 0: open clock gating.
 */

#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON    (BIT(0))
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_M  (EXTMEM_DCACHE_TAG_MEM_FORCE_ON_V << EXTMEM_DCACHE_TAG_MEM_FORCE_ON_S)
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_V  0x00000001
#define EXTMEM_DCACHE_TAG_MEM_FORCE_ON_S  0

/* EXTMEM_DCACHE_PRELOCK_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOCK_CTRL_REG (DR_REG_EXTMEM_BASE + 0xc)

/* EXTMEM_DCACHE_PRELOCK_SCT1_EN : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable the second section of prelock function.
 */

#define EXTMEM_DCACHE_PRELOCK_SCT1_EN    (BIT(1))
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_M  (EXTMEM_DCACHE_PRELOCK_SCT1_EN_V << EXTMEM_DCACHE_PRELOCK_SCT1_EN_S)
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_V  0x00000001
#define EXTMEM_DCACHE_PRELOCK_SCT1_EN_S  1

/* EXTMEM_DCACHE_PRELOCK_SCT0_EN : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable the first section of prelock function.
 */

#define EXTMEM_DCACHE_PRELOCK_SCT0_EN    (BIT(0))
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_M  (EXTMEM_DCACHE_PRELOCK_SCT0_EN_V << EXTMEM_DCACHE_PRELOCK_SCT0_EN_S)
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_V  0x00000001
#define EXTMEM_DCACHE_PRELOCK_SCT0_EN_S  0

/* EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_REG register
 * ******* Description ***********
 */

