apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_REG (DR_REG_EXTMEM_BASE + 0x10)

/* EXTMEM_DCACHE_PRELOCK_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the first start virtual address of data
 * prelock, which is combined with DCACHE_PRELOCK_SCT0_SIZE_REG
 */

#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR    0xffffffff
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_M  (EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_V << EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_S)
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_PRELOCK_SCT0_ADDR_S  0

/* EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_REG (DR_REG_EXTMEM_BASE + 0x14)

/* EXTMEM_DCACHE_PRELOCK_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the second start virtual address of data
 * prelock, which is combined with DCACHE_PRELOCK_SCT1_SIZE_REG
 */

#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR    0xffffffff
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_M  (EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_V << EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_S)
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_PRELOCK_SCT1_ADDR_S  0

/* EXTMEM_DCACHE_PRELOCK_SCT_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOCK_SCT_SIZE_REG (DR_REG_EXTMEM_BASE + 0x18)

/* EXTMEM_DCACHE_PRELOCK_SCT0_SIZE : R/W; bitpos: [31:16]; default: 0;
 * The bits are used to configure the first length of data locking, which is
 * combined with DCACHE_PRELOCK_SCT0_ADDR_REG
 */

#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE    0x0000ffff
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_M  (EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_V << EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_S)
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_V  0x0000ffff
#define EXTMEM_DCACHE_PRELOCK_SCT0_SIZE_S  16

/* EXTMEM_DCACHE_PRELOCK_SCT1_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the second length of data locking, which
 * is combined with DCACHE_PRELOCK_SCT1_ADDR_REG
 */

#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE    0x0000ffff
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_M  (EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_V << EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_S)
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_V  0x0000ffff
#define EXTMEM_DCACHE_PRELOCK_SCT1_SIZE_S  0

/* EXTMEM_DCACHE_LOCK_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_LOCK_CTRL_REG (DR_REG_EXTMEM_BASE + 0x1c)

/* EXTMEM_DCACHE_LOCK_DONE : RO; bitpos: [2]; default: 1;
 * The bit is used to indicate unlock/lock operation is finished.
 */

#define EXTMEM_DCACHE_LOCK_DONE    (BIT(2))
#define EXTMEM_DCACHE_LOCK_DONE_M  (EXTMEM_DCACHE_LOCK_DONE_V << EXTMEM_DCACHE_LOCK_DONE_S)
#define EXTMEM_DCACHE_LOCK_DONE_V  0x00000001
#define EXTMEM_DCACHE_LOCK_DONE_S  2

/* EXTMEM_DCACHE_UNLOCK_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable unlock operation. It will be cleared by
 * hardware after unlock operation done.
 */

#define EXTMEM_DCACHE_UNLOCK_ENA    (BIT(1))
#define EXTMEM_DCACHE_UNLOCK_ENA_M  (EXTMEM_DCACHE_UNLOCK_ENA_V << EXTMEM_DCACHE_UNLOCK_ENA_S)
#define EXTMEM_DCACHE_UNLOCK_ENA_V  0x00000001
#define EXTMEM_DCACHE_UNLOCK_ENA_S  1

/* EXTMEM_DCACHE_LOCK_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable lock operation. It will be cleared by hardware
 * after lock operation done.
 */

#define EXTMEM_DCACHE_LOCK_ENA    (BIT(0))
#define EXTMEM_DCACHE_LOCK_ENA_M  (EXTMEM_DCACHE_LOCK_ENA_V << EXTMEM_DCACHE_LOCK_ENA_S)
#define EXTMEM_DCACHE_LOCK_ENA_V  0x00000001
#define EXTMEM_DCACHE_LOCK_ENA_S  0

/* EXTMEM_DCACHE_LOCK_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_LOCK_ADDR_REG (DR_REG_EXTMEM_BASE + 0x20)

/* EXTMEM_DCACHE_LOCK_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for lock
 * operations. It should be combined with DCACHE_LOCK_SIZE_REG.
 */

#define EXTMEM_DCACHE_LOCK_ADDR    0xffffffff
#define EXTMEM_DCACHE_LOCK_ADDR_M  (EXTMEM_DCACHE_LOCK_ADDR_V << EXTMEM_DCACHE_LOCK_ADDR_S)
#define EXTMEM_DCACHE_LOCK_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_LOCK_ADDR_S  0

/* EXTMEM_DCACHE_LOCK_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_LOCK_SIZE_REG (DR_REG_EXTMEM_BASE + 0x24)

/* EXTMEM_DCACHE_LOCK_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the length for lock operations. The bits
 * are the counts of cache block. It should be combined with
 * DCACHE_LOCK_ADDR_REG.
 */

#define EXTMEM_DCACHE_LOCK_SIZE    0x0000ffff
#define EXTMEM_DCACHE_LOCK_SIZE_M  (EXTMEM_DCACHE_LOCK_SIZE_V << EXTMEM_DCACHE_LOCK_SIZE_S)
#define EXTMEM_DCACHE_LOCK_SIZE_V  0x0000ffff
#define EXTMEM_DCACHE_LOCK_SIZE_S  0

/* EXTMEM_DCACHE_SYNC_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_SYNC_CTRL_REG (DR_REG_EXTMEM_BASE + 0x28)

/* EXTMEM_DCACHE_SYNC_DONE : RO; bitpos: [3]; default: 0;
 * The bit is used to indicate clean/writeback/invalidate operation is
 * finished.
 */

#define EXTMEM_DCACHE_SYNC_DONE    (BIT(3))
#define EXTMEM_DCACHE_SYNC_DONE_M  (EXTMEM_DCACHE_SYNC_DONE_V << EXTMEM_DCACHE_SYNC_DONE_S)
#define EXTMEM_DCACHE_SYNC_DONE_V  0x00000001
#define EXTMEM_DCACHE_SYNC_DONE_S  3

/* EXTMEM_DCACHE_CLEAN_ENA : R/W; bitpos: [2]; default: 0;
 * The bit is used to enable clean operation. It will be cleared by hardware
 * after clean operation done.
 */

#define EXTMEM_DCACHE_CLEAN_ENA    (BIT(2))
#define EXTMEM_DCACHE_CLEAN_ENA_M  (EXTMEM_DCACHE_CLEAN_ENA_V << EXTMEM_DCACHE_CLEAN_ENA_S)
#define EXTMEM_DCACHE_CLEAN_ENA_V  0x00000001
#define EXTMEM_DCACHE_CLEAN_ENA_S  2

/* EXTMEM_DCACHE_WRITEBACK_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable writeback operation. It will be cleared by
 * hardware after writeback operation done.
 */

#define EXTMEM_DCACHE_WRITEBACK_ENA    (BIT(1))
#define EXTMEM_DCACHE_WRITEBACK_ENA_M  (EXTMEM_DCACHE_WRITEBACK_ENA_V << EXTMEM_DCACHE_WRITEBACK_ENA_S)
#define EXTMEM_DCACHE_WRITEBACK_ENA_V  0x00000001
#define EXTMEM_DCACHE_WRITEBACK_ENA_S  1

