apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_DCACHE_INVALIDATE_ENA : R/W; bitpos: [0]; default: 1;
 * The bit is used to enable invalidate operation. It will be cleared by
 * hardware after invalidate operation done.
 */

#define EXTMEM_DCACHE_INVALIDATE_ENA    (BIT(0))
#define EXTMEM_DCACHE_INVALIDATE_ENA_M  (EXTMEM_DCACHE_INVALIDATE_ENA_V << EXTMEM_DCACHE_INVALIDATE_ENA_S)
#define EXTMEM_DCACHE_INVALIDATE_ENA_V  0x00000001
#define EXTMEM_DCACHE_INVALIDATE_ENA_S  0

/* EXTMEM_DCACHE_SYNC_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_SYNC_ADDR_REG (DR_REG_EXTMEM_BASE + 0x2c)

/* EXTMEM_DCACHE_SYNC_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for clean
 * operations. It should be combined with DCACHE_SYNC_SIZE_REG.
 */

#define EXTMEM_DCACHE_SYNC_ADDR    0xffffffff
#define EXTMEM_DCACHE_SYNC_ADDR_M  (EXTMEM_DCACHE_SYNC_ADDR_V << EXTMEM_DCACHE_SYNC_ADDR_S)
#define EXTMEM_DCACHE_SYNC_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_SYNC_ADDR_S  0

/* EXTMEM_DCACHE_SYNC_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_SYNC_SIZE_REG (DR_REG_EXTMEM_BASE + 0x30)

/* EXTMEM_DCACHE_SYNC_SIZE : R/W; bitpos: [22:0]; default: 0;
 * The bits are used to configure the length for sync operations. The bits
 * are the counts of cache block. It should be combined with
 * DCACHE_SYNC_ADDR_REG.
 */

#define EXTMEM_DCACHE_SYNC_SIZE    0x007fffff
#define EXTMEM_DCACHE_SYNC_SIZE_M  (EXTMEM_DCACHE_SYNC_SIZE_V << EXTMEM_DCACHE_SYNC_SIZE_S)
#define EXTMEM_DCACHE_SYNC_SIZE_V  0x007fffff
#define EXTMEM_DCACHE_SYNC_SIZE_S  0

/* EXTMEM_DCACHE_OCCUPY_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_OCCUPY_CTRL_REG (DR_REG_EXTMEM_BASE + 0x34)

/* EXTMEM_DCACHE_OCCUPY_DONE : RO; bitpos: [1]; default: 1;
 * The bit is used to indicate occupy operation is finished.
 */

#define EXTMEM_DCACHE_OCCUPY_DONE    (BIT(1))
#define EXTMEM_DCACHE_OCCUPY_DONE_M  (EXTMEM_DCACHE_OCCUPY_DONE_V << EXTMEM_DCACHE_OCCUPY_DONE_S)
#define EXTMEM_DCACHE_OCCUPY_DONE_V  0x00000001
#define EXTMEM_DCACHE_OCCUPY_DONE_S  1

/* EXTMEM_DCACHE_OCCUPY_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable occupy operation. It will be cleared by
 * hardware after issuing Auot-Invalidate Operation.
 */

#define EXTMEM_DCACHE_OCCUPY_ENA    (BIT(0))
#define EXTMEM_DCACHE_OCCUPY_ENA_M  (EXTMEM_DCACHE_OCCUPY_ENA_V << EXTMEM_DCACHE_OCCUPY_ENA_S)
#define EXTMEM_DCACHE_OCCUPY_ENA_V  0x00000001
#define EXTMEM_DCACHE_OCCUPY_ENA_S  0

/* EXTMEM_DCACHE_OCCUPY_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_OCCUPY_ADDR_REG (DR_REG_EXTMEM_BASE + 0x38)

/* EXTMEM_DCACHE_OCCUPY_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for occupy
 * operation. It should be combined with DCACHE_OCCUPY_SIZE_REG.
 */

#define EXTMEM_DCACHE_OCCUPY_ADDR    0xffffffff
#define EXTMEM_DCACHE_OCCUPY_ADDR_M  (EXTMEM_DCACHE_OCCUPY_ADDR_V << EXTMEM_DCACHE_OCCUPY_ADDR_S)
#define EXTMEM_DCACHE_OCCUPY_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_OCCUPY_ADDR_S  0

/* EXTMEM_DCACHE_OCCUPY_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_OCCUPY_SIZE_REG (DR_REG_EXTMEM_BASE + 0x3c)

/* EXTMEM_DCACHE_OCCUPY_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the length for occupy operation. The bits
 * are the counts of cache block. It should be combined with
 * DCACHE_OCCUPY_ADDR_REG.
 */

#define EXTMEM_DCACHE_OCCUPY_SIZE    0x0000ffff
#define EXTMEM_DCACHE_OCCUPY_SIZE_M  (EXTMEM_DCACHE_OCCUPY_SIZE_V << EXTMEM_DCACHE_OCCUPY_SIZE_S)
#define EXTMEM_DCACHE_OCCUPY_SIZE_V  0x0000ffff
#define EXTMEM_DCACHE_OCCUPY_SIZE_S  0

/* EXTMEM_DCACHE_PRELOAD_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOAD_CTRL_REG (DR_REG_EXTMEM_BASE + 0x40)

/* EXTMEM_DCACHE_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 * The bit is used to configure the direction of preload operation. 1:
 * descending, 0: ascending.
 */

#define EXTMEM_DCACHE_PRELOAD_ORDER    (BIT(2))
#define EXTMEM_DCACHE_PRELOAD_ORDER_M  (EXTMEM_DCACHE_PRELOAD_ORDER_V << EXTMEM_DCACHE_PRELOAD_ORDER_S)
#define EXTMEM_DCACHE_PRELOAD_ORDER_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_ORDER_S  2

/* EXTMEM_DCACHE_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 * The bit is used to indicate preload operation is finished.
 */

#define EXTMEM_DCACHE_PRELOAD_DONE    (BIT(1))
#define EXTMEM_DCACHE_PRELOAD_DONE_M  (EXTMEM_DCACHE_PRELOAD_DONE_V << EXTMEM_DCACHE_PRELOAD_DONE_S)
#define EXTMEM_DCACHE_PRELOAD_DONE_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_DONE_S  1

/* EXTMEM_DCACHE_PRELOAD_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable preload operation. It will be cleared by
 * hardware after preload operation done.
 */

#define EXTMEM_DCACHE_PRELOAD_ENA    (BIT(0))
#define EXTMEM_DCACHE_PRELOAD_ENA_M  (EXTMEM_DCACHE_PRELOAD_ENA_V << EXTMEM_DCACHE_PRELOAD_ENA_S)
#define EXTMEM_DCACHE_PRELOAD_ENA_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_ENA_S  0

/* EXTMEM_DCACHE_PRELOAD_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOAD_ADDR_REG (DR_REG_EXTMEM_BASE + 0x44)

/* EXTMEM_DCACHE_PRELOAD_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for preload
 * operation. It should be combined with DCACHE_PRELOAD_SIZE_REG.
 */

#define EXTMEM_DCACHE_PRELOAD_ADDR    0xffffffff
#define EXTMEM_DCACHE_PRELOAD_ADDR_M  (EXTMEM_DCACHE_PRELOAD_ADDR_V << EXTMEM_DCACHE_PRELOAD_ADDR_S)
#define EXTMEM_DCACHE_PRELOAD_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_PRELOAD_ADDR_S  0

/* EXTMEM_DCACHE_PRELOAD_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_PRELOAD_SIZE_REG (DR_REG_EXTMEM_BASE + 0x48)

/* EXTMEM_DCACHE_PRELOAD_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the length for preload operation. The bits
 * are the counts of cache block. It should be combined with
 * DCACHE_PRELOAD_ADDR_REG..
 */

