apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
#define EXTMEM_DCACHE_PRELOAD_SIZE    0x0000ffff
#define EXTMEM_DCACHE_PRELOAD_SIZE_M  (EXTMEM_DCACHE_PRELOAD_SIZE_V << EXTMEM_DCACHE_PRELOAD_SIZE_S)
#define EXTMEM_DCACHE_PRELOAD_SIZE_V  0x0000ffff
#define EXTMEM_DCACHE_PRELOAD_SIZE_S  0

/* EXTMEM_DCACHE_AUTOLOAD_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_AUTOLOAD_CTRL_REG (DR_REG_EXTMEM_BASE + 0x4c)

/* EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR : R/W; bitpos: [9]; default: 0;
 * The bit is used to clear autoload buffer in dcache.
 */

#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR    (BIT(9))
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_M  (EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_V << EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_S)
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_BUFFER_CLEAR_S  9

/* EXTMEM_DCACHE_AUTOLOAD_SIZE : R/W; bitpos: [8:7]; default: 0;
 * The bits are used to configure the numbers of the cache block for the
 * issuing autoload operation.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SIZE    0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_M  (EXTMEM_DCACHE_AUTOLOAD_SIZE_V << EXTMEM_DCACHE_AUTOLOAD_SIZE_S)
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_V  0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_SIZE_S  7

/* EXTMEM_DCACHE_AUTOLOAD_RQST : R/W; bitpos: [6:5]; default: 0;
 * The bits are used to configure trigger conditions for autoload. 0/3:
 * cache miss, 1: cache hit, 2: both cache miss and hit.
 */

#define EXTMEM_DCACHE_AUTOLOAD_RQST    0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_RQST_M  (EXTMEM_DCACHE_AUTOLOAD_RQST_V << EXTMEM_DCACHE_AUTOLOAD_RQST_S)
#define EXTMEM_DCACHE_AUTOLOAD_RQST_V  0x00000003
#define EXTMEM_DCACHE_AUTOLOAD_RQST_S  5

/* EXTMEM_DCACHE_AUTOLOAD_ORDER : R/W; bitpos: [4]; default: 0;
 * The bits are used to configure the direction of autoload. 1: descending,
 * 0: ascending.
 */

#define EXTMEM_DCACHE_AUTOLOAD_ORDER    (BIT(4))
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_M  (EXTMEM_DCACHE_AUTOLOAD_ORDER_V << EXTMEM_DCACHE_AUTOLOAD_ORDER_S)
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_ORDER_S  4

/* EXTMEM_DCACHE_AUTOLOAD_DONE : RO; bitpos: [3]; default: 1;
 * The bit is used to indicate autoload operation is finished.
 */

#define EXTMEM_DCACHE_AUTOLOAD_DONE    (BIT(3))
#define EXTMEM_DCACHE_AUTOLOAD_DONE_M  (EXTMEM_DCACHE_AUTOLOAD_DONE_V << EXTMEM_DCACHE_AUTOLOAD_DONE_S)
#define EXTMEM_DCACHE_AUTOLOAD_DONE_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_DONE_S  3

/* EXTMEM_DCACHE_AUTOLOAD_ENA : R/W; bitpos: [2]; default: 0;
 * The bit is used to enable and disable autoload operation. It is combined
 * with dcache_autoload_done. 1: enable, 0: disable.
 */

#define EXTMEM_DCACHE_AUTOLOAD_ENA    (BIT(2))
#define EXTMEM_DCACHE_AUTOLOAD_ENA_M  (EXTMEM_DCACHE_AUTOLOAD_ENA_V << EXTMEM_DCACHE_AUTOLOAD_ENA_S)
#define EXTMEM_DCACHE_AUTOLOAD_ENA_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_ENA_S  2

/* EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA : R/W; bitpos: [1]; default: 0;
 * The bits are used to enable the second section for autoload operation.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA    (BIT(1))
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_M  (EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_V << EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ENA_S  1

/* EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA : R/W; bitpos: [0]; default: 0;
 * The bits are used to enable the first section for autoload operation.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA    (BIT(0))
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_M  (EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_V << EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_V  0x00000001
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ENA_S  0

/* EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_REG (DR_REG_EXTMEM_BASE + 0x50)

/* EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address of the first
 * section for autoload operation. It should be combined with
 * dcache_autoload_sct0_ena.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR    0xffffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_M  (EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_V << EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_ADDR_S  0

/* EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_REG (DR_REG_EXTMEM_BASE + 0x54)

/* EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE : R/W; bitpos: [26:0]; default: 0;
 * The bits are used to configure the length of the first section for
 * autoload operation. It should be combined with dcache_autoload_sct0_ena.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE    0x07ffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_M  (EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_V << EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_V  0x07ffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT0_SIZE_S  0

/* EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_REG (DR_REG_EXTMEM_BASE + 0x58)

/* EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address of the second
 * section for autoload operation. It should be combined with
 * dcache_autoload_sct1_ena.
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR    0xffffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_M  (EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_V << EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_V  0xffffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_ADDR_S  0

/* EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_REG (DR_REG_EXTMEM_BASE + 0x5c)

/* EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE : R/W; bitpos: [26:0]; default: 0;
 * The bits are used to configure the length of the second section for
 * autoload operation. It should be combined with dcache_autoload_sct1_ena.
 */

