apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE    0x07ffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_M  (EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_V << EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_S)
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_V  0x07ffffff
#define EXTMEM_DCACHE_AUTOLOAD_SCT1_SIZE_S  0

/* EXTMEM_ICACHE_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_CTRL_REG (DR_REG_EXTMEM_BASE + 0x60)

/* EXTMEM_ICACHE_BLOCKSIZE_MODE : R/W; bitpos: [3]; default: 0;
 * The bit is used to configure cache block size.0: 16 bytes, 1: 32 bytes
 */

#define EXTMEM_ICACHE_BLOCKSIZE_MODE    (BIT(3))
#define EXTMEM_ICACHE_BLOCKSIZE_MODE_M  (EXTMEM_ICACHE_BLOCKSIZE_MODE_V << EXTMEM_ICACHE_BLOCKSIZE_MODE_S)
#define EXTMEM_ICACHE_BLOCKSIZE_MODE_V  0x00000001
#define EXTMEM_ICACHE_BLOCKSIZE_MODE_S  3

/* EXTMEM_ICACHE_SIZE_MODE : R/W; bitpos: [2]; default: 0;
 * The bit is used to configure cache memory size.0: 16KB, 1: 32KB
 */

#define EXTMEM_ICACHE_SIZE_MODE    (BIT(2))
#define EXTMEM_ICACHE_SIZE_MODE_M  (EXTMEM_ICACHE_SIZE_MODE_V << EXTMEM_ICACHE_SIZE_MODE_S)
#define EXTMEM_ICACHE_SIZE_MODE_V  0x00000001
#define EXTMEM_ICACHE_SIZE_MODE_S  2

/* EXTMEM_ICACHE_WAY_MODE : R/W; bitpos: [1]; default: 0;
 * The bit is used to configure cache way mode.0: 4-way, 1: 8-way
 */

#define EXTMEM_ICACHE_WAY_MODE    (BIT(1))
#define EXTMEM_ICACHE_WAY_MODE_M  (EXTMEM_ICACHE_WAY_MODE_V << EXTMEM_ICACHE_WAY_MODE_S)
#define EXTMEM_ICACHE_WAY_MODE_V  0x00000001
#define EXTMEM_ICACHE_WAY_MODE_S  1

/* EXTMEM_ICACHE_ENABLE : R/W; bitpos: [0]; default: 0;
 * The bit is used to activate the data cache. 0: disable, 1: enable
 */

#define EXTMEM_ICACHE_ENABLE    (BIT(0))
#define EXTMEM_ICACHE_ENABLE_M  (EXTMEM_ICACHE_ENABLE_V << EXTMEM_ICACHE_ENABLE_S)
#define EXTMEM_ICACHE_ENABLE_V  0x00000001
#define EXTMEM_ICACHE_ENABLE_S  0

/* EXTMEM_ICACHE_CTRL1_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_CTRL1_REG (DR_REG_EXTMEM_BASE + 0x64)

/* EXTMEM_ICACHE_SHUT_CORE1_BUS : R/W; bitpos: [1]; default: 1;
 * The bit is used to disable core1 ibus, 0: enable, 1: disable
 */

#define EXTMEM_ICACHE_SHUT_CORE1_BUS    (BIT(1))
#define EXTMEM_ICACHE_SHUT_CORE1_BUS_M  (EXTMEM_ICACHE_SHUT_CORE1_BUS_V << EXTMEM_ICACHE_SHUT_CORE1_BUS_S)
#define EXTMEM_ICACHE_SHUT_CORE1_BUS_V  0x00000001
#define EXTMEM_ICACHE_SHUT_CORE1_BUS_S  1

/* EXTMEM_ICACHE_SHUT_CORE0_BUS : R/W; bitpos: [0]; default: 1;
 * The bit is used to disable core0 ibus, 0: enable, 1: disable
 */

#define EXTMEM_ICACHE_SHUT_CORE0_BUS    (BIT(0))
#define EXTMEM_ICACHE_SHUT_CORE0_BUS_M  (EXTMEM_ICACHE_SHUT_CORE0_BUS_V << EXTMEM_ICACHE_SHUT_CORE0_BUS_S)
#define EXTMEM_ICACHE_SHUT_CORE0_BUS_V  0x00000001
#define EXTMEM_ICACHE_SHUT_CORE0_BUS_S  0

/* EXTMEM_ICACHE_TAG_POWER_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_TAG_POWER_CTRL_REG (DR_REG_EXTMEM_BASE + 0x68)

/* EXTMEM_ICACHE_TAG_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 * The bit is used to power  icache tag memory up, 0: follow rtc_lslp, 1:
 * power up
 */

#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU    (BIT(2))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_PU_V << EXTMEM_ICACHE_TAG_MEM_FORCE_PU_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_V  0x00000001
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PU_S  2

/* EXTMEM_ICACHE_TAG_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 * The bit is used to power  icache tag memory down, 0: follow rtc_lslp, 1:
 * power down
 */

#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD    (BIT(1))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_PD_V << EXTMEM_ICACHE_TAG_MEM_FORCE_PD_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_V  0x00000001
#define EXTMEM_ICACHE_TAG_MEM_FORCE_PD_S  1

/* EXTMEM_ICACHE_TAG_MEM_FORCE_ON : R/W; bitpos: [0]; default: 1;
 * The bit is used to close clock gating of  icache tag memory. 1: close
 * gating, 0: open clock gating.
 */

#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON    (BIT(0))
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_M  (EXTMEM_ICACHE_TAG_MEM_FORCE_ON_V << EXTMEM_ICACHE_TAG_MEM_FORCE_ON_S)
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_V  0x00000001
#define EXTMEM_ICACHE_TAG_MEM_FORCE_ON_S  0

/* EXTMEM_ICACHE_PRELOCK_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_PRELOCK_CTRL_REG (DR_REG_EXTMEM_BASE + 0x6c)

/* EXTMEM_ICACHE_PRELOCK_SCT1_EN : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable the second section of prelock function.
 */

#define EXTMEM_ICACHE_PRELOCK_SCT1_EN    (BIT(1))
#define EXTMEM_ICACHE_PRELOCK_SCT1_EN_M  (EXTMEM_ICACHE_PRELOCK_SCT1_EN_V << EXTMEM_ICACHE_PRELOCK_SCT1_EN_S)
#define EXTMEM_ICACHE_PRELOCK_SCT1_EN_V  0x00000001
#define EXTMEM_ICACHE_PRELOCK_SCT1_EN_S  1

/* EXTMEM_ICACHE_PRELOCK_SCT0_EN : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable the first section of prelock function.
 */

#define EXTMEM_ICACHE_PRELOCK_SCT0_EN    (BIT(0))
#define EXTMEM_ICACHE_PRELOCK_SCT0_EN_M  (EXTMEM_ICACHE_PRELOCK_SCT0_EN_V << EXTMEM_ICACHE_PRELOCK_SCT0_EN_S)
#define EXTMEM_ICACHE_PRELOCK_SCT0_EN_V  0x00000001
#define EXTMEM_ICACHE_PRELOCK_SCT0_EN_S  0

/* EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_REG (DR_REG_EXTMEM_BASE + 0x70)

/* EXTMEM_ICACHE_PRELOCK_SCT0_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the first start virtual address of data
 * prelock, which is combined with ICACHE_PRELOCK_SCT0_SIZE_REG
 */

#define EXTMEM_ICACHE_PRELOCK_SCT0_ADDR    0xffffffff
#define EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_M  (EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_V << EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_S)
#define EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_V  0xffffffff
#define EXTMEM_ICACHE_PRELOCK_SCT0_ADDR_S  0

/* EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_REG (DR_REG_EXTMEM_BASE + 0x74)

/* EXTMEM_ICACHE_PRELOCK_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the second start virtual address of data
 * prelock, which is combined with ICACHE_PRELOCK_SCT1_SIZE_REG
 */

#define EXTMEM_ICACHE_PRELOCK_SCT1_ADDR    0xffffffff
#define EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_M  (EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_V << EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_S)
#define EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_V  0xffffffff
#define EXTMEM_ICACHE_PRELOCK_SCT1_ADDR_S  0

/* EXTMEM_ICACHE_PRELOCK_SCT_SIZE_REG register
 * ******* Description ***********
 */

