apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
#define EXTMEM_ICACHE_PRELOCK_SCT_SIZE_REG (DR_REG_EXTMEM_BASE + 0x78)

/* EXTMEM_ICACHE_PRELOCK_SCT0_SIZE : R/W; bitpos: [31:16]; default: 0;
 * The bits are used to configure the first length of data locking, which is
 * combined with ICACHE_PRELOCK_SCT0_ADDR_REG
 */

#define EXTMEM_ICACHE_PRELOCK_SCT0_SIZE    0x0000ffff
#define EXTMEM_ICACHE_PRELOCK_SCT0_SIZE_M  (EXTMEM_ICACHE_PRELOCK_SCT0_SIZE_V << EXTMEM_ICACHE_PRELOCK_SCT0_SIZE_S)
#define EXTMEM_ICACHE_PRELOCK_SCT0_SIZE_V  0x0000ffff
#define EXTMEM_ICACHE_PRELOCK_SCT0_SIZE_S  16

/* EXTMEM_ICACHE_PRELOCK_SCT1_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the second length of data locking, which
 * is combined with ICACHE_PRELOCK_SCT1_ADDR_REG
 */

#define EXTMEM_ICACHE_PRELOCK_SCT1_SIZE    0x0000ffff
#define EXTMEM_ICACHE_PRELOCK_SCT1_SIZE_M  (EXTMEM_ICACHE_PRELOCK_SCT1_SIZE_V << EXTMEM_ICACHE_PRELOCK_SCT1_SIZE_S)
#define EXTMEM_ICACHE_PRELOCK_SCT1_SIZE_V  0x0000ffff
#define EXTMEM_ICACHE_PRELOCK_SCT1_SIZE_S  0

/* EXTMEM_ICACHE_LOCK_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_LOCK_CTRL_REG (DR_REG_EXTMEM_BASE + 0x7c)

/* EXTMEM_ICACHE_LOCK_DONE : RO; bitpos: [2]; default: 1;
 * The bit is used to indicate unlock/lock operation is finished.
 */

#define EXTMEM_ICACHE_LOCK_DONE    (BIT(2))
#define EXTMEM_ICACHE_LOCK_DONE_M  (EXTMEM_ICACHE_LOCK_DONE_V << EXTMEM_ICACHE_LOCK_DONE_S)
#define EXTMEM_ICACHE_LOCK_DONE_V  0x00000001
#define EXTMEM_ICACHE_LOCK_DONE_S  2

/* EXTMEM_ICACHE_UNLOCK_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable unlock operation. It will be cleared by
 * hardware after unlock operation done.
 */

#define EXTMEM_ICACHE_UNLOCK_ENA    (BIT(1))
#define EXTMEM_ICACHE_UNLOCK_ENA_M  (EXTMEM_ICACHE_UNLOCK_ENA_V << EXTMEM_ICACHE_UNLOCK_ENA_S)
#define EXTMEM_ICACHE_UNLOCK_ENA_V  0x00000001
#define EXTMEM_ICACHE_UNLOCK_ENA_S  1

/* EXTMEM_ICACHE_LOCK_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable lock operation. It will be cleared by hardware
 * after lock operation done.
 */

#define EXTMEM_ICACHE_LOCK_ENA    (BIT(0))
#define EXTMEM_ICACHE_LOCK_ENA_M  (EXTMEM_ICACHE_LOCK_ENA_V << EXTMEM_ICACHE_LOCK_ENA_S)
#define EXTMEM_ICACHE_LOCK_ENA_V  0x00000001
#define EXTMEM_ICACHE_LOCK_ENA_S  0

/* EXTMEM_ICACHE_LOCK_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_LOCK_ADDR_REG (DR_REG_EXTMEM_BASE + 0x80)

/* EXTMEM_ICACHE_LOCK_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for lock
 * operations. It should be combined with ICACHE_LOCK_SIZE_REG.
 */

#define EXTMEM_ICACHE_LOCK_ADDR    0xffffffff
#define EXTMEM_ICACHE_LOCK_ADDR_M  (EXTMEM_ICACHE_LOCK_ADDR_V << EXTMEM_ICACHE_LOCK_ADDR_S)
#define EXTMEM_ICACHE_LOCK_ADDR_V  0xffffffff
#define EXTMEM_ICACHE_LOCK_ADDR_S  0

/* EXTMEM_ICACHE_LOCK_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_LOCK_SIZE_REG (DR_REG_EXTMEM_BASE + 0x84)

/* EXTMEM_ICACHE_LOCK_SIZE : R/W; bitpos: [15:0]; default: 0;
 * The bits are used to configure the length for lock operations. The bits
 * are the counts of cache block. It should be combined with
 * ICACHE_LOCK_ADDR_REG.
 */

#define EXTMEM_ICACHE_LOCK_SIZE    0x0000ffff
#define EXTMEM_ICACHE_LOCK_SIZE_M  (EXTMEM_ICACHE_LOCK_SIZE_V << EXTMEM_ICACHE_LOCK_SIZE_S)
#define EXTMEM_ICACHE_LOCK_SIZE_V  0x0000ffff
#define EXTMEM_ICACHE_LOCK_SIZE_S  0

/* EXTMEM_ICACHE_SYNC_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_SYNC_CTRL_REG (DR_REG_EXTMEM_BASE + 0x88)

/* EXTMEM_ICACHE_SYNC_DONE : RO; bitpos: [1]; default: 0;
 * The bit is used to indicate invalidate operation is finished.
 */

#define EXTMEM_ICACHE_SYNC_DONE    (BIT(1))
#define EXTMEM_ICACHE_SYNC_DONE_M  (EXTMEM_ICACHE_SYNC_DONE_V << EXTMEM_ICACHE_SYNC_DONE_S)
#define EXTMEM_ICACHE_SYNC_DONE_V  0x00000001
#define EXTMEM_ICACHE_SYNC_DONE_S  1

/* EXTMEM_ICACHE_INVALIDATE_ENA : R/W; bitpos: [0]; default: 1;
 * The bit is used to enable invalidate operation. It will be cleared by
 * hardware after invalidate operation done.
 */

#define EXTMEM_ICACHE_INVALIDATE_ENA    (BIT(0))
#define EXTMEM_ICACHE_INVALIDATE_ENA_M  (EXTMEM_ICACHE_INVALIDATE_ENA_V << EXTMEM_ICACHE_INVALIDATE_ENA_S)
#define EXTMEM_ICACHE_INVALIDATE_ENA_V  0x00000001
#define EXTMEM_ICACHE_INVALIDATE_ENA_S  0

/* EXTMEM_ICACHE_SYNC_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_SYNC_ADDR_REG (DR_REG_EXTMEM_BASE + 0x8c)

/* EXTMEM_ICACHE_SYNC_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address for clean
 * operations. It should be combined with ICACHE_SYNC_SIZE_REG.
 */

#define EXTMEM_ICACHE_SYNC_ADDR    0xffffffff
#define EXTMEM_ICACHE_SYNC_ADDR_M  (EXTMEM_ICACHE_SYNC_ADDR_V << EXTMEM_ICACHE_SYNC_ADDR_S)
#define EXTMEM_ICACHE_SYNC_ADDR_V  0xffffffff
#define EXTMEM_ICACHE_SYNC_ADDR_S  0

/* EXTMEM_ICACHE_SYNC_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_SYNC_SIZE_REG (DR_REG_EXTMEM_BASE + 0x90)

/* EXTMEM_ICACHE_SYNC_SIZE : R/W; bitpos: [22:0]; default: 0;
 * The bits are used to configure the length for sync operations. The bits
 * are the counts of cache block. It should be combined with
 * ICACHE_SYNC_ADDR_REG.
 */

#define EXTMEM_ICACHE_SYNC_SIZE    0x007fffff
#define EXTMEM_ICACHE_SYNC_SIZE_M  (EXTMEM_ICACHE_SYNC_SIZE_V << EXTMEM_ICACHE_SYNC_SIZE_S)
#define EXTMEM_ICACHE_SYNC_SIZE_V  0x007fffff
#define EXTMEM_ICACHE_SYNC_SIZE_S  0

/* EXTMEM_ICACHE_PRELOAD_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_PRELOAD_CTRL_REG (DR_REG_EXTMEM_BASE + 0x94)

/* EXTMEM_ICACHE_PRELOAD_ORDER : R/W; bitpos: [2]; default: 0;
 * The bit is used to configure the direction of preload operation. 1:
 * descending, 0: ascending.
 */

#define EXTMEM_ICACHE_PRELOAD_ORDER    (BIT(2))
#define EXTMEM_ICACHE_PRELOAD_ORDER_M  (EXTMEM_ICACHE_PRELOAD_ORDER_V << EXTMEM_ICACHE_PRELOAD_ORDER_S)
#define EXTMEM_ICACHE_PRELOAD_ORDER_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_ORDER_S  2

/* EXTMEM_ICACHE_PRELOAD_DONE : RO; bitpos: [1]; default: 1;
 * The bit is used to indicate preload operation is finished.
 */

