apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE : R/W; bitpos: [26:0]; default: 0;
 * The bits are used to configure the length of the first section for
 * autoload operation. It should be combined with icache_autoload_sct0_ena.
 */

#define EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE    0x07ffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE_M  (EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE_V << EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE_S)
#define EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE_V  0x07ffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT0_SIZE_S  0

/* EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_REG (DR_REG_EXTMEM_BASE + 0xac)

/* EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address of the second
 * section for autoload operation. It should be combined with
 * icache_autoload_sct1_ena.
 */

#define EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR    0xffffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_M  (EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_V << EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_S)
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_V  0xffffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_ADDR_S  0

/* EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_REG (DR_REG_EXTMEM_BASE + 0xb0)

/* EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE : R/W; bitpos: [26:0]; default: 0;
 * The bits are used to configure the length of the second section for
 * autoload operation. It should be combined with icache_autoload_sct1_ena.
 */

#define EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE    0x07ffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_M  (EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_V << EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_S)
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_V  0x07ffffff
#define EXTMEM_ICACHE_AUTOLOAD_SCT1_SIZE_S  0

/* EXTMEM_IBUS_TO_FLASH_START_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_IBUS_TO_FLASH_START_VADDR_REG (DR_REG_EXTMEM_BASE + 0xb4)

/* EXTMEM_IBUS_TO_FLASH_START_VADDR : R/W; bitpos: [31:0]; default:
 * 1140850688;
 * The bits are used to configure the start virtual address of ibus to
 * access flash. The register is used to give constraints to ibus access
 * counter.
 */

#define EXTMEM_IBUS_TO_FLASH_START_VADDR    0xffffffff
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_M  (EXTMEM_IBUS_TO_FLASH_START_VADDR_V << EXTMEM_IBUS_TO_FLASH_START_VADDR_S)
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_V  0xffffffff
#define EXTMEM_IBUS_TO_FLASH_START_VADDR_S  0

/* EXTMEM_IBUS_TO_FLASH_END_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_IBUS_TO_FLASH_END_VADDR_REG (DR_REG_EXTMEM_BASE + 0xb8)

/* EXTMEM_IBUS_TO_FLASH_END_VADDR : R/W; bitpos: [31:0]; default: 1207959551;
 * The bits are used to configure the end virtual address of ibus to access
 * flash. The register is used to give constraints to ibus access counter.
 */

#define EXTMEM_IBUS_TO_FLASH_END_VADDR    0xffffffff
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_M  (EXTMEM_IBUS_TO_FLASH_END_VADDR_V << EXTMEM_IBUS_TO_FLASH_END_VADDR_S)
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_V  0xffffffff
#define EXTMEM_IBUS_TO_FLASH_END_VADDR_S  0

/* EXTMEM_DBUS_TO_FLASH_START_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DBUS_TO_FLASH_START_VADDR_REG (DR_REG_EXTMEM_BASE + 0xbc)

/* EXTMEM_DBUS_TO_FLASH_START_VADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the start virtual address of dbus to
 * access flash. The register is used to give constraints to dbus access
 * counter.
 */

#define EXTMEM_DBUS_TO_FLASH_START_VADDR    0xffffffff
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_M  (EXTMEM_DBUS_TO_FLASH_START_VADDR_V << EXTMEM_DBUS_TO_FLASH_START_VADDR_S)
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_V  0xffffffff
#define EXTMEM_DBUS_TO_FLASH_START_VADDR_S  0

/* EXTMEM_DBUS_TO_FLASH_END_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_DBUS_TO_FLASH_END_VADDR_REG (DR_REG_EXTMEM_BASE + 0xc0)

/* EXTMEM_DBUS_TO_FLASH_END_VADDR : R/W; bitpos: [31:0]; default: 0;
 * The bits are used to configure the end virtual address of dbus to access
 * flash. The register is used to give constraints to dbus access counter.
 */

#define EXTMEM_DBUS_TO_FLASH_END_VADDR    0xffffffff
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_M  (EXTMEM_DBUS_TO_FLASH_END_VADDR_V << EXTMEM_DBUS_TO_FLASH_END_VADDR_S)
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_V  0xffffffff
#define EXTMEM_DBUS_TO_FLASH_END_VADDR_S  0

/* EXTMEM_CACHE_ACS_CNT_CLR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ACS_CNT_CLR_REG (DR_REG_EXTMEM_BASE + 0xc4)

/* EXTMEM_ICACHE_ACS_CNT_CLR : WOD; bitpos: [1]; default: 0;
 * The bit is used to clear icache counter.
 */

#define EXTMEM_ICACHE_ACS_CNT_CLR    (BIT(1))
#define EXTMEM_ICACHE_ACS_CNT_CLR_M  (EXTMEM_ICACHE_ACS_CNT_CLR_V << EXTMEM_ICACHE_ACS_CNT_CLR_S)
#define EXTMEM_ICACHE_ACS_CNT_CLR_V  0x00000001
#define EXTMEM_ICACHE_ACS_CNT_CLR_S  1

/* EXTMEM_DCACHE_ACS_CNT_CLR : WOD; bitpos: [0]; default: 0;
 * The bit is used to clear dcache counter.
 */

#define EXTMEM_DCACHE_ACS_CNT_CLR    (BIT(0))
#define EXTMEM_DCACHE_ACS_CNT_CLR_M  (EXTMEM_DCACHE_ACS_CNT_CLR_V << EXTMEM_DCACHE_ACS_CNT_CLR_S)
#define EXTMEM_DCACHE_ACS_CNT_CLR_V  0x00000001
#define EXTMEM_DCACHE_ACS_CNT_CLR_S  0

/* EXTMEM_IBUS_ACS_MISS_CNT_REG register
 * ******* Description ***********
 */

#define EXTMEM_IBUS_ACS_MISS_CNT_REG (DR_REG_EXTMEM_BASE + 0xc8)

/* EXTMEM_IBUS_ACS_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 * The bits are used to count the number of the cache miss caused by ibus
 * access flash/spiram.
 */

#define EXTMEM_IBUS_ACS_MISS_CNT    0xffffffff
#define EXTMEM_IBUS_ACS_MISS_CNT_M  (EXTMEM_IBUS_ACS_MISS_CNT_V << EXTMEM_IBUS_ACS_MISS_CNT_S)
#define EXTMEM_IBUS_ACS_MISS_CNT_V  0xffffffff
#define EXTMEM_IBUS_ACS_MISS_CNT_S  0

/* EXTMEM_IBUS_ACS_CNT_REG register
 * ******* Description ***********
 */

#define EXTMEM_IBUS_ACS_CNT_REG (DR_REG_EXTMEM_BASE + 0xcc)

/* EXTMEM_IBUS_ACS_CNT : RO; bitpos: [31:0]; default: 0;
 * The bits are used to count the number of ibus access flash/spiram through
 * icache.
 */

#define EXTMEM_IBUS_ACS_CNT    0xffffffff
#define EXTMEM_IBUS_ACS_CNT_M  (EXTMEM_IBUS_ACS_CNT_V << EXTMEM_IBUS_ACS_CNT_S)
#define EXTMEM_IBUS_ACS_CNT_V  0xffffffff
#define EXTMEM_IBUS_ACS_CNT_S  0

/* EXTMEM_DBUS_ACS_FLASH_MISS_CNT_REG register
 * ******* Description ***********
 */

#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_REG (DR_REG_EXTMEM_BASE + 0xd0)

/* EXTMEM_DBUS_ACS_FLASH_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 * The bits are used to count the number of the cache miss caused by dbus
 * access flash.
 */

#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT    0xffffffff
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_M  (EXTMEM_DBUS_ACS_FLASH_MISS_CNT_V << EXTMEM_DBUS_ACS_FLASH_MISS_CNT_S)
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_V  0xffffffff
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_S  0

/* EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_REG register
 * ******* Description ***********
 */

#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_REG (DR_REG_EXTMEM_BASE + 0xd4)

/* EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT : RO; bitpos: [31:0]; default: 0;
 * The bits are used to count the number of the cache miss caused by dbus
 * access spiram.
 */

#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT    0xffffffff
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_M  (EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_V << EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_S)
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_V  0xffffffff
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_S  0

/* EXTMEM_DBUS_ACS_CNT_REG register
 * ******* Description ***********
 */

#define EXTMEM_DBUS_ACS_CNT_REG (DR_REG_EXTMEM_BASE + 0xd8)

/* EXTMEM_DBUS_ACS_CNT : RO; bitpos: [31:0]; default: 0;
 * The bits are used to count the number of dbus access flash/spiram through
 * dcache.
 */

#define EXTMEM_DBUS_ACS_CNT    0xffffffff
#define EXTMEM_DBUS_ACS_CNT_M  (EXTMEM_DBUS_ACS_CNT_V << EXTMEM_DBUS_ACS_CNT_S)
#define EXTMEM_DBUS_ACS_CNT_V  0xffffffff
#define EXTMEM_DBUS_ACS_CNT_S  0

/* EXTMEM_CACHE_ILG_INT_ENA_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ILG_INT_ENA_REG (DR_REG_EXTMEM_BASE + 0xdc)

/* EXTMEM_DBUS_CNT_OVF_INT_ENA : R/W; bitpos: [8]; default: 0;
 * The bit is used to enable interrupt by dbus counter overflow.
 */

#define EXTMEM_DBUS_CNT_OVF_INT_ENA    (BIT(8))
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_M  (EXTMEM_DBUS_CNT_OVF_INT_ENA_V << EXTMEM_DBUS_CNT_OVF_INT_ENA_S)
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_V  0x00000001
#define EXTMEM_DBUS_CNT_OVF_INT_ENA_S  8

