apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_IBUS_CNT_OVF_INT_ENA : R/W; bitpos: [7]; default: 0;
 * The bit is used to enable interrupt by ibus counter overflow.
 */

#define EXTMEM_IBUS_CNT_OVF_INT_ENA    (BIT(7))
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_M  (EXTMEM_IBUS_CNT_OVF_INT_ENA_V << EXTMEM_IBUS_CNT_OVF_INT_ENA_S)
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_V  0x00000001
#define EXTMEM_IBUS_CNT_OVF_INT_ENA_S  7

/* EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA : R/W; bitpos: [6]; default: 0;
 * The bit is used to enable interrupt by dcache trying to replace a line
 * whose blocks all have been occupied by occupy-mode.
 */

#define EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA    (BIT(6))
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA_M  (EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA_V << EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA_S)
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_ENA_S  6

/* EXTMEM_MMU_ENTRY_FAULT_INT_ENA : R/W; bitpos: [5]; default: 0;
 * The bit is used to enable interrupt by mmu entry fault.
 */

#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_M  (EXTMEM_MMU_ENTRY_FAULT_INT_ENA_V << EXTMEM_MMU_ENTRY_FAULT_INT_ENA_S)
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_V  0x00000001
#define EXTMEM_MMU_ENTRY_FAULT_INT_ENA_S  5

/* EXTMEM_DCACHE_WRITE_FLASH_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The bit is used to enable interrupt by dcache trying to write flash.
 */

#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA    (BIT(4))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_M  (EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_V << EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_S)
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_WRITE_FLASH_INT_ENA_S  4

/* EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA : R/W; bitpos: [3]; default: 0;
 * The bit is used to enable interrupt by preload configurations fault.
 */

#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA    (BIT(3))
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA_M  (EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA_V << EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA_S)
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_ENA_S  3

/* EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA : R/W; bitpos: [2]; default: 0;
 * The bit is used to enable interrupt by sync configurations fault.
 */

#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA    (BIT(2))
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA_M  (EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA_V << EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA_S)
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_ENA_S  2

/* EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable interrupt by preload configurations fault.
 */

#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_ENA_S  1

/* EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable interrupt by sync configurations fault.
 */

#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_V << EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_V  0x00000001
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_ENA_S  0

/* EXTMEM_CACHE_ILG_INT_CLR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ILG_INT_CLR_REG (DR_REG_EXTMEM_BASE + 0xe0)

/* EXTMEM_DBUS_CNT_OVF_INT_CLR : WOD; bitpos: [8]; default: 0;
 * The bit is used to clear interrupt by dbus counter overflow.
 */

#define EXTMEM_DBUS_CNT_OVF_INT_CLR    (BIT(8))
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_M  (EXTMEM_DBUS_CNT_OVF_INT_CLR_V << EXTMEM_DBUS_CNT_OVF_INT_CLR_S)
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_V  0x00000001
#define EXTMEM_DBUS_CNT_OVF_INT_CLR_S  8

/* EXTMEM_IBUS_CNT_OVF_INT_CLR : WOD; bitpos: [7]; default: 0;
 * The bit is used to clear interrupt by ibus counter overflow.
 */

#define EXTMEM_IBUS_CNT_OVF_INT_CLR    (BIT(7))
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_M  (EXTMEM_IBUS_CNT_OVF_INT_CLR_V << EXTMEM_IBUS_CNT_OVF_INT_CLR_S)
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_V  0x00000001
#define EXTMEM_IBUS_CNT_OVF_INT_CLR_S  7

/* EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR : WOD; bitpos: [6]; default: 0;
 * The bit is used to clear interrupt by dcache trying to replace a line
 * whose blocks all have been occupied by occupy-mode.
 */

#define EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR    (BIT(6))
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR_M  (EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR_V << EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR_S)
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_OCCUPY_EXC_INT_CLR_S  6

/* EXTMEM_MMU_ENTRY_FAULT_INT_CLR : WOD; bitpos: [5]; default: 0;
 * The bit is used to clear interrupt by mmu entry fault.
 */

#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_M  (EXTMEM_MMU_ENTRY_FAULT_INT_CLR_V << EXTMEM_MMU_ENTRY_FAULT_INT_CLR_S)
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_V  0x00000001
#define EXTMEM_MMU_ENTRY_FAULT_INT_CLR_S  5

/* EXTMEM_DCACHE_WRITE_FLASH_INT_CLR : WOD; bitpos: [4]; default: 0;
 * The bit is used to clear interrupt by dcache trying to write flash.
 */

#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR    (BIT(4))
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_M  (EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_V << EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_S)
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_WRITE_FLASH_INT_CLR_S  4

/* EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR : WOD; bitpos: [3]; default: 0;
 * The bit is used to clear interrupt by preload configurations fault.
 */

#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR    (BIT(3))
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR_M  (EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR_V << EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR_S)
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_INT_CLR_S  3

/* EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR : WOD; bitpos: [2]; default: 0;
 * The bit is used to clear interrupt by sync configurations fault.
 */

#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR    (BIT(2))
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR_M  (EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR_V << EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR_S)
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_SYNC_OP_FAULT_INT_CLR_S  2

/* EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR : WOD; bitpos: [1]; default: 0;
 * The bit is used to clear interrupt by preload configurations fault.
 */

#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_INT_CLR_S  1

