apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR : WOD; bitpos: [0]; default: 0;
 * The bit is used to clear interrupt by sync configurations fault.
 */

#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_V << EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_V  0x00000001
#define EXTMEM_ICACHE_SYNC_OP_FAULT_INT_CLR_S  0

/* EXTMEM_CACHE_ILG_INT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ILG_INT_ST_REG (DR_REG_EXTMEM_BASE + 0xe4)

/* EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST : RO; bitpos: [11]; default: 0;
 * The bit is used to indicate interrupt by dbus access spiram miss counter
 * overflow.
 */

#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST    (BIT(11))
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST_M  (EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST_V << EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST_S)
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST_V  0x00000001
#define EXTMEM_DBUS_ACS_SPIRAM_MISS_CNT_OVF_ST_S  11

/* EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST : RO; bitpos: [10]; default: 0;
 * The bit is used to indicate interrupt by dbus access flash miss counter
 * overflow.
 */

#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST    (BIT(10))
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_M  (EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_V << EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_S)
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_V  0x00000001
#define EXTMEM_DBUS_ACS_FLASH_MISS_CNT_OVF_ST_S  10

/* EXTMEM_DBUS_ACS_CNT_OVF_ST : RO; bitpos: [9]; default: 0;
 * The bit is used to indicate interrupt by dbus access flash/spiram counter
 * overflow.
 */

#define EXTMEM_DBUS_ACS_CNT_OVF_ST    (BIT(9))
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_M  (EXTMEM_DBUS_ACS_CNT_OVF_ST_V << EXTMEM_DBUS_ACS_CNT_OVF_ST_S)
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_V  0x00000001
#define EXTMEM_DBUS_ACS_CNT_OVF_ST_S  9

/* EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST : RO; bitpos: [8]; default: 0;
 * The bit is used to indicate interrupt by ibus access flash/spiram miss
 * counter overflow.
 */

#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST    (BIT(8))
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_M  (EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_V << EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_S)
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_V  0x00000001
#define EXTMEM_IBUS_ACS_MISS_CNT_OVF_ST_S  8

/* EXTMEM_IBUS_ACS_CNT_OVF_ST : RO; bitpos: [7]; default: 0;
 * The bit is used to indicate interrupt by ibus access flash/spiram counter
 * overflow.
 */

#define EXTMEM_IBUS_ACS_CNT_OVF_ST    (BIT(7))
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_M  (EXTMEM_IBUS_ACS_CNT_OVF_ST_V << EXTMEM_IBUS_ACS_CNT_OVF_ST_S)
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_V  0x00000001
#define EXTMEM_IBUS_ACS_CNT_OVF_ST_S  7

/* EXTMEM_DCACHE_OCCUPY_EXC_ST : RO; bitpos: [6]; default: 0;
 * The bit is used to indicate interrupt by dcache trying to replace a line
 * whose blocks all have been occupied by occupy-mode.
 */

#define EXTMEM_DCACHE_OCCUPY_EXC_ST    (BIT(6))
#define EXTMEM_DCACHE_OCCUPY_EXC_ST_M  (EXTMEM_DCACHE_OCCUPY_EXC_ST_V << EXTMEM_DCACHE_OCCUPY_EXC_ST_S)
#define EXTMEM_DCACHE_OCCUPY_EXC_ST_V  0x00000001
#define EXTMEM_DCACHE_OCCUPY_EXC_ST_S  6

/* EXTMEM_MMU_ENTRY_FAULT_ST : RO; bitpos: [5]; default: 0;
 * The bit is used to indicate interrupt by mmu entry fault.
 */

#define EXTMEM_MMU_ENTRY_FAULT_ST    (BIT(5))
#define EXTMEM_MMU_ENTRY_FAULT_ST_M  (EXTMEM_MMU_ENTRY_FAULT_ST_V << EXTMEM_MMU_ENTRY_FAULT_ST_S)
#define EXTMEM_MMU_ENTRY_FAULT_ST_V  0x00000001
#define EXTMEM_MMU_ENTRY_FAULT_ST_S  5

/* EXTMEM_DCACHE_WRITE_FLASH_ST : RO; bitpos: [4]; default: 0;
 * The bit is used to indicate interrupt by dcache trying to write flash.
 */

#define EXTMEM_DCACHE_WRITE_FLASH_ST    (BIT(4))
#define EXTMEM_DCACHE_WRITE_FLASH_ST_M  (EXTMEM_DCACHE_WRITE_FLASH_ST_V << EXTMEM_DCACHE_WRITE_FLASH_ST_S)
#define EXTMEM_DCACHE_WRITE_FLASH_ST_V  0x00000001
#define EXTMEM_DCACHE_WRITE_FLASH_ST_S  4

/* EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST : RO; bitpos: [3]; default: 0;
 * The bit is used to indicate interrupt by preload configurations fault.
 */

#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST    (BIT(3))
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST_M  (EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST_V << EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST_S)
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_OP_FAULT_ST_S  3

/* EXTMEM_DCACHE_SYNC_OP_FAULT_ST : RO; bitpos: [2]; default: 0;
 * The bit is used to indicate interrupt by sync configurations fault.
 */

#define EXTMEM_DCACHE_SYNC_OP_FAULT_ST    (BIT(2))
#define EXTMEM_DCACHE_SYNC_OP_FAULT_ST_M  (EXTMEM_DCACHE_SYNC_OP_FAULT_ST_V << EXTMEM_DCACHE_SYNC_OP_FAULT_ST_S)
#define EXTMEM_DCACHE_SYNC_OP_FAULT_ST_V  0x00000001
#define EXTMEM_DCACHE_SYNC_OP_FAULT_ST_S  2

/* EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST : RO; bitpos: [1]; default: 0;
 * The bit is used to indicate interrupt by preload configurations fault.
 */

#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_M  (EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_V << EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_S)
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_OP_FAULT_ST_S  1

/* EXTMEM_ICACHE_SYNC_OP_FAULT_ST : RO; bitpos: [0]; default: 0;
 * The bit is used to indicate interrupt by sync configurations fault.
 */

#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST    (BIT(0))
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_M  (EXTMEM_ICACHE_SYNC_OP_FAULT_ST_V << EXTMEM_ICACHE_SYNC_OP_FAULT_ST_S)
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_V  0x00000001
#define EXTMEM_ICACHE_SYNC_OP_FAULT_ST_S  0

/* EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE0_ACS_CACHE_INT_ENA_REG (DR_REG_EXTMEM_BASE + 0xe8)

/* EXTMEM_CORE0_DBUS_REJECT_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The bit is used to enable interrupt by authentication fail.
 */

#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA    (BIT(4))
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_M  (EXTMEM_CORE0_DBUS_REJECT_INT_ENA_V << EXTMEM_CORE0_DBUS_REJECT_INT_ENA_S)
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_V  0x00000001
#define EXTMEM_CORE0_DBUS_REJECT_INT_ENA_S  4

/* EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA : R/W; bitpos: [3]; default: 0;
 * The bit is used to enable interrupt by cpu access dcache while the
 * corresponding dbus is disabled which include speculative access.
 */

#define EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA    (BIT(3))
#define EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA_M  (EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA_V << EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA_S)
#define EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA_V  0x00000001
#define EXTMEM_CORE0_DBUS_ACS_MSK_DC_INT_ENA_S  3

/* EXTMEM_CORE0_IBUS_REJECT_INT_ENA : R/W; bitpos: [2]; default: 0;
 * The bit is used to enable interrupt by authentication fail.
 */

#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA    (BIT(2))
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_M  (EXTMEM_CORE0_IBUS_REJECT_INT_ENA_V << EXTMEM_CORE0_IBUS_REJECT_INT_ENA_S)
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_V  0x00000001
#define EXTMEM_CORE0_IBUS_REJECT_INT_ENA_S  2

/* EXTMEM_CORE0_IBUS_WR_IC_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable interrupt by ibus trying to write icache
 */

#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA    (BIT(1))
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_M  (EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_V << EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_S)
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_V  0x00000001
#define EXTMEM_CORE0_IBUS_WR_IC_INT_ENA_S  1

/* EXTMEM_CORE0_IBUS_ACS_MSK_IC_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable interrupt by cpu access icache while the
 * corresponding ibus is disabled which include speculative access.
 */

