apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
#define EXTMEM_CORE1_IBUS_REJECT_INT_ENA    (BIT(2))
#define EXTMEM_CORE1_IBUS_REJECT_INT_ENA_M  (EXTMEM_CORE1_IBUS_REJECT_INT_ENA_V << EXTMEM_CORE1_IBUS_REJECT_INT_ENA_S)
#define EXTMEM_CORE1_IBUS_REJECT_INT_ENA_V  0x00000001
#define EXTMEM_CORE1_IBUS_REJECT_INT_ENA_S  2

/* EXTMEM_CORE1_IBUS_WR_IC_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable interrupt by ibus trying to write icache
 */

#define EXTMEM_CORE1_IBUS_WR_IC_INT_ENA    (BIT(1))
#define EXTMEM_CORE1_IBUS_WR_IC_INT_ENA_M  (EXTMEM_CORE1_IBUS_WR_IC_INT_ENA_V << EXTMEM_CORE1_IBUS_WR_IC_INT_ENA_S)
#define EXTMEM_CORE1_IBUS_WR_IC_INT_ENA_V  0x00000001
#define EXTMEM_CORE1_IBUS_WR_IC_INT_ENA_S  1

/* EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable interrupt by cpu access icache while the
 * corresponding ibus is disabled which include speculative access.
 */

#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA    (BIT(0))
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA_M  (EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA_V << EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA_S)
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA_V  0x00000001
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_ENA_S  0

/* EXTMEM_CORE1_ACS_CACHE_INT_CLR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_ACS_CACHE_INT_CLR_REG (DR_REG_EXTMEM_BASE + 0xf8)

/* EXTMEM_CORE1_DBUS_REJECT_INT_CLR : WOD; bitpos: [4]; default: 0;
 * The bit is used to clear interrupt by authentication fail.
 */

#define EXTMEM_CORE1_DBUS_REJECT_INT_CLR    (BIT(4))
#define EXTMEM_CORE1_DBUS_REJECT_INT_CLR_M  (EXTMEM_CORE1_DBUS_REJECT_INT_CLR_V << EXTMEM_CORE1_DBUS_REJECT_INT_CLR_S)
#define EXTMEM_CORE1_DBUS_REJECT_INT_CLR_V  0x00000001
#define EXTMEM_CORE1_DBUS_REJECT_INT_CLR_S  4

/* EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR : WOD; bitpos: [3]; default: 0;
 * The bit is used to clear interrupt by cpu access dcache while the
 * corresponding dbus is disabled or dcache is disabled which include
 * speculative access.
 */

#define EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR    (BIT(3))
#define EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR_M  (EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR_V << EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR_S)
#define EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR_V  0x00000001
#define EXTMEM_CORE1_DBUS_ACS_MSK_DC_INT_CLR_S  3

/* EXTMEM_CORE1_IBUS_REJECT_INT_CLR : WOD; bitpos: [2]; default: 0;
 * The bit is used to clear interrupt by authentication fail.
 */

#define EXTMEM_CORE1_IBUS_REJECT_INT_CLR    (BIT(2))
#define EXTMEM_CORE1_IBUS_REJECT_INT_CLR_M  (EXTMEM_CORE1_IBUS_REJECT_INT_CLR_V << EXTMEM_CORE1_IBUS_REJECT_INT_CLR_S)
#define EXTMEM_CORE1_IBUS_REJECT_INT_CLR_V  0x00000001
#define EXTMEM_CORE1_IBUS_REJECT_INT_CLR_S  2

/* EXTMEM_CORE1_IBUS_WR_IC_INT_CLR : WOD; bitpos: [1]; default: 0;
 * The bit is used to clear interrupt by ibus trying to write icache
 */

#define EXTMEM_CORE1_IBUS_WR_IC_INT_CLR    (BIT(1))
#define EXTMEM_CORE1_IBUS_WR_IC_INT_CLR_M  (EXTMEM_CORE1_IBUS_WR_IC_INT_CLR_V << EXTMEM_CORE1_IBUS_WR_IC_INT_CLR_S)
#define EXTMEM_CORE1_IBUS_WR_IC_INT_CLR_V  0x00000001
#define EXTMEM_CORE1_IBUS_WR_IC_INT_CLR_S  1

/* EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR : WOD; bitpos: [0]; default: 0;
 * The bit is used to clear interrupt by cpu access icache while the
 * corresponding ibus is disabled or icache is disabled which include
 * speculative access.
 */

#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR    (BIT(0))
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR_M  (EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR_V << EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR_S)
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR_V  0x00000001
#define EXTMEM_CORE1_IBUS_ACS_MSK_IC_INT_CLR_S  0

/* EXTMEM_CORE1_ACS_CACHE_INT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_ACS_CACHE_INT_ST_REG (DR_REG_EXTMEM_BASE + 0xfc)

/* EXTMEM_CORE1_DBUS_REJECT_ST : RO; bitpos: [4]; default: 0;
 * The bit is used to indicate interrupt by authentication fail.
 */

#define EXTMEM_CORE1_DBUS_REJECT_ST    (BIT(4))
#define EXTMEM_CORE1_DBUS_REJECT_ST_M  (EXTMEM_CORE1_DBUS_REJECT_ST_V << EXTMEM_CORE1_DBUS_REJECT_ST_S)
#define EXTMEM_CORE1_DBUS_REJECT_ST_V  0x00000001
#define EXTMEM_CORE1_DBUS_REJECT_ST_S  4

/* EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST : RO; bitpos: [3]; default: 0;
 * The bit is used to indicate interrupt by cpu access dcache while the
 * core1_dbus is disabled or dcache is disabled which include speculative
 * access.
 */

#define EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST    (BIT(3))
#define EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST_M  (EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST_V << EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST_S)
#define EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST_V  0x00000001
#define EXTMEM_CORE1_DBUS_ACS_MSK_DCACHE_ST_S  3

/* EXTMEM_CORE1_IBUS_REJECT_ST : RO; bitpos: [2]; default: 0;
 * The bit is used to indicate interrupt by authentication fail.
 */

#define EXTMEM_CORE1_IBUS_REJECT_ST    (BIT(2))
#define EXTMEM_CORE1_IBUS_REJECT_ST_M  (EXTMEM_CORE1_IBUS_REJECT_ST_V << EXTMEM_CORE1_IBUS_REJECT_ST_S)
#define EXTMEM_CORE1_IBUS_REJECT_ST_V  0x00000001
#define EXTMEM_CORE1_IBUS_REJECT_ST_S  2

/* EXTMEM_CORE1_IBUS_WR_ICACHE_ST : RO; bitpos: [1]; default: 0;
 * The bit is used to indicate interrupt by ibus trying to write icache
 */

#define EXTMEM_CORE1_IBUS_WR_ICACHE_ST    (BIT(1))
#define EXTMEM_CORE1_IBUS_WR_ICACHE_ST_M  (EXTMEM_CORE1_IBUS_WR_ICACHE_ST_V << EXTMEM_CORE1_IBUS_WR_ICACHE_ST_S)
#define EXTMEM_CORE1_IBUS_WR_ICACHE_ST_V  0x00000001
#define EXTMEM_CORE1_IBUS_WR_ICACHE_ST_S  1

/* EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST : RO; bitpos: [0]; default: 0;
 * The bit is used to indicate interrupt by cpu access  icache while the
 * core1_ibus is disabled or  icache is disabled which include speculative
 * access.
 */

#define EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST    (BIT(0))
#define EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST_M  (EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST_V << EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST_S)
#define EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST_V  0x00000001
#define EXTMEM_CORE1_IBUS_ACS_MSK_ICACHE_ST_S  0

