apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_CORE0_DBUS_REJECT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE0_DBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x100)

/* EXTMEM_CORE0_DBUS_WORLD : RO; bitpos: [6]; default: 0;
 * The bit is used to indicate the world of CPU access dbus when
 * authentication fail. 0: WORLD0, 1: WORLD1
 */

#define EXTMEM_CORE0_DBUS_WORLD    (BIT(6))
#define EXTMEM_CORE0_DBUS_WORLD_M  (EXTMEM_CORE0_DBUS_WORLD_V << EXTMEM_CORE0_DBUS_WORLD_S)
#define EXTMEM_CORE0_DBUS_WORLD_V  0x00000001
#define EXTMEM_CORE0_DBUS_WORLD_S  6

/* EXTMEM_CORE0_DBUS_ATTR : RO; bitpos: [5:3]; default: 0;
 * The bits are used to indicate the attribute of CPU access dbus when
 * authentication fail. 0: invalidate, 1: execute-able, 2: read-able, 4:
 * write-able.
 */

#define EXTMEM_CORE0_DBUS_ATTR    0x00000007
#define EXTMEM_CORE0_DBUS_ATTR_M  (EXTMEM_CORE0_DBUS_ATTR_V << EXTMEM_CORE0_DBUS_ATTR_S)
#define EXTMEM_CORE0_DBUS_ATTR_V  0x00000007
#define EXTMEM_CORE0_DBUS_ATTR_S  3

/* EXTMEM_CORE0_DBUS_TAG_ATTR : RO; bitpos: [2:0]; default: 0;
 * The bits are used to indicate the attribute of data from external memory
 * when authentication fail. 0: invalidate, 1: execute-able, 2: read-able,
 * 4: write-able.
 */

#define EXTMEM_CORE0_DBUS_TAG_ATTR    0x00000007
#define EXTMEM_CORE0_DBUS_TAG_ATTR_M  (EXTMEM_CORE0_DBUS_TAG_ATTR_V << EXTMEM_CORE0_DBUS_TAG_ATTR_S)
#define EXTMEM_CORE0_DBUS_TAG_ATTR_V  0x00000007
#define EXTMEM_CORE0_DBUS_TAG_ATTR_S  0

/* EXTMEM_CORE0_DBUS_REJECT_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE0_DBUS_REJECT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x104)

/* EXTMEM_CORE0_DBUS_VADDR : RO; bitpos: [31:0]; default: 4294967295;
 * The bits are used to indicate the virtual address of CPU access dbus when
 * authentication fail.
 */

#define EXTMEM_CORE0_DBUS_VADDR    0xffffffff
#define EXTMEM_CORE0_DBUS_VADDR_M  (EXTMEM_CORE0_DBUS_VADDR_V << EXTMEM_CORE0_DBUS_VADDR_S)
#define EXTMEM_CORE0_DBUS_VADDR_V  0xffffffff
#define EXTMEM_CORE0_DBUS_VADDR_S  0

/* EXTMEM_CORE0_IBUS_REJECT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE0_IBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x108)

/* EXTMEM_CORE0_IBUS_WORLD : RO; bitpos: [6]; default: 0;
 * The bit is used to indicate the world of CPU access ibus when
 * authentication fail. 0: WORLD0, 1: WORLD1
 */

#define EXTMEM_CORE0_IBUS_WORLD    (BIT(6))
#define EXTMEM_CORE0_IBUS_WORLD_M  (EXTMEM_CORE0_IBUS_WORLD_V << EXTMEM_CORE0_IBUS_WORLD_S)
#define EXTMEM_CORE0_IBUS_WORLD_V  0x00000001
#define EXTMEM_CORE0_IBUS_WORLD_S  6

/* EXTMEM_CORE0_IBUS_ATTR : RO; bitpos: [5:3]; default: 0;
 * The bits are used to indicate the attribute of CPU access ibus when
 * authentication fail. 0: invalidate, 1: execute-able, 2: read-able
 */

#define EXTMEM_CORE0_IBUS_ATTR    0x00000007
#define EXTMEM_CORE0_IBUS_ATTR_M  (EXTMEM_CORE0_IBUS_ATTR_V << EXTMEM_CORE0_IBUS_ATTR_S)
#define EXTMEM_CORE0_IBUS_ATTR_V  0x00000007
#define EXTMEM_CORE0_IBUS_ATTR_S  3

/* EXTMEM_CORE0_IBUS_TAG_ATTR : RO; bitpos: [2:0]; default: 0;
 * The bits are used to indicate the attribute of data from external memory
 * when authentication fail. 0: invalidate, 1: execute-able, 2: read-able,
 * 4: write-able.
 */

#define EXTMEM_CORE0_IBUS_TAG_ATTR    0x00000007
#define EXTMEM_CORE0_IBUS_TAG_ATTR_M  (EXTMEM_CORE0_IBUS_TAG_ATTR_V << EXTMEM_CORE0_IBUS_TAG_ATTR_S)
#define EXTMEM_CORE0_IBUS_TAG_ATTR_V  0x00000007
#define EXTMEM_CORE0_IBUS_TAG_ATTR_S  0

/* EXTMEM_CORE0_IBUS_REJECT_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE0_IBUS_REJECT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x10c)

/* EXTMEM_CORE0_IBUS_VADDR : RO; bitpos: [31:0]; default: 4294967295;
 * The bits are used to indicate the virtual address of CPU access  ibus
 * when authentication fail.
 */

#define EXTMEM_CORE0_IBUS_VADDR    0xffffffff
#define EXTMEM_CORE0_IBUS_VADDR_M  (EXTMEM_CORE0_IBUS_VADDR_V << EXTMEM_CORE0_IBUS_VADDR_S)
#define EXTMEM_CORE0_IBUS_VADDR_V  0xffffffff
#define EXTMEM_CORE0_IBUS_VADDR_S  0

/* EXTMEM_CORE1_DBUS_REJECT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_DBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x110)

/* EXTMEM_CORE1_DBUS_WORLD : RO; bitpos: [6]; default: 0;
 * The bit is used to indicate the world of CPU access dbus when
 * authentication fail. 0: WORLD0, 1: WORLD1
 */

#define EXTMEM_CORE1_DBUS_WORLD    (BIT(6))
#define EXTMEM_CORE1_DBUS_WORLD_M  (EXTMEM_CORE1_DBUS_WORLD_V << EXTMEM_CORE1_DBUS_WORLD_S)
#define EXTMEM_CORE1_DBUS_WORLD_V  0x00000001
#define EXTMEM_CORE1_DBUS_WORLD_S  6

/* EXTMEM_CORE1_DBUS_ATTR : RO; bitpos: [5:3]; default: 0;
 * The bits are used to indicate the attribute of CPU access dbus when
 * authentication fail. 0: invalidate, 1: execute-able, 2: read-able, 4:
 * write-able.
 */

#define EXTMEM_CORE1_DBUS_ATTR    0x00000007
#define EXTMEM_CORE1_DBUS_ATTR_M  (EXTMEM_CORE1_DBUS_ATTR_V << EXTMEM_CORE1_DBUS_ATTR_S)
#define EXTMEM_CORE1_DBUS_ATTR_V  0x00000007
#define EXTMEM_CORE1_DBUS_ATTR_S  3

/* EXTMEM_CORE1_DBUS_TAG_ATTR : RO; bitpos: [2:0]; default: 0;
 * The bits are used to indicate the attribute of data from external memory
 * when authentication fail. 0: invalidate, 1: execute-able, 2: read-able,
 * 4: write-able.
 */

#define EXTMEM_CORE1_DBUS_TAG_ATTR    0x00000007
#define EXTMEM_CORE1_DBUS_TAG_ATTR_M  (EXTMEM_CORE1_DBUS_TAG_ATTR_V << EXTMEM_CORE1_DBUS_TAG_ATTR_S)
#define EXTMEM_CORE1_DBUS_TAG_ATTR_V  0x00000007
#define EXTMEM_CORE1_DBUS_TAG_ATTR_S  0

/* EXTMEM_CORE1_DBUS_REJECT_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_DBUS_REJECT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x114)

/* EXTMEM_CORE1_DBUS_VADDR : RO; bitpos: [31:0]; default: 4294967295;
 * The bits are used to indicate the virtual address of CPU access dbus when
 * authentication fail.
 */

#define EXTMEM_CORE1_DBUS_VADDR    0xffffffff
#define EXTMEM_CORE1_DBUS_VADDR_M  (EXTMEM_CORE1_DBUS_VADDR_V << EXTMEM_CORE1_DBUS_VADDR_S)
#define EXTMEM_CORE1_DBUS_VADDR_V  0xffffffff
#define EXTMEM_CORE1_DBUS_VADDR_S  0

/* EXTMEM_CORE1_IBUS_REJECT_ST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_IBUS_REJECT_ST_REG (DR_REG_EXTMEM_BASE + 0x118)

/* EXTMEM_CORE1_IBUS_WORLD : RO; bitpos: [6]; default: 0;
 * The bit is used to indicate the world of CPU access ibus when
 * authentication fail. 0: WORLD0, 1: WORLD1
 */

#define EXTMEM_CORE1_IBUS_WORLD    (BIT(6))
#define EXTMEM_CORE1_IBUS_WORLD_M  (EXTMEM_CORE1_IBUS_WORLD_V << EXTMEM_CORE1_IBUS_WORLD_S)
#define EXTMEM_CORE1_IBUS_WORLD_V  0x00000001
#define EXTMEM_CORE1_IBUS_WORLD_S  6

/* EXTMEM_CORE1_IBUS_ATTR : RO; bitpos: [5:3]; default: 0;
 * The bits are used to indicate the attribute of CPU access ibus when
 * authentication fail. 0: invalidate, 1: execute-able, 2: read-able
 */

#define EXTMEM_CORE1_IBUS_ATTR    0x00000007
#define EXTMEM_CORE1_IBUS_ATTR_M  (EXTMEM_CORE1_IBUS_ATTR_V << EXTMEM_CORE1_IBUS_ATTR_S)
#define EXTMEM_CORE1_IBUS_ATTR_V  0x00000007
#define EXTMEM_CORE1_IBUS_ATTR_S  3

/* EXTMEM_CORE1_IBUS_TAG_ATTR : RO; bitpos: [2:0]; default: 0;
 * The bits are used to indicate the attribute of data from external memory
 * when authentication fail. 0: invalidate, 1: execute-able, 2: read-able,
 * 4: write-able.
 */

#define EXTMEM_CORE1_IBUS_TAG_ATTR    0x00000007
#define EXTMEM_CORE1_IBUS_TAG_ATTR_M  (EXTMEM_CORE1_IBUS_TAG_ATTR_V << EXTMEM_CORE1_IBUS_TAG_ATTR_S)
#define EXTMEM_CORE1_IBUS_TAG_ATTR_V  0x00000007
#define EXTMEM_CORE1_IBUS_TAG_ATTR_S  0

