apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_CORE1_IBUS_REJECT_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CORE1_IBUS_REJECT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x11c)

/* EXTMEM_CORE1_IBUS_VADDR : RO; bitpos: [31:0]; default: 4294967295;
 * The bits are used to indicate the virtual address of CPU access  ibus
 * when authentication fail.
 */

#define EXTMEM_CORE1_IBUS_VADDR    0xffffffff
#define EXTMEM_CORE1_IBUS_VADDR_M  (EXTMEM_CORE1_IBUS_VADDR_V << EXTMEM_CORE1_IBUS_VADDR_S)
#define EXTMEM_CORE1_IBUS_VADDR_V  0xffffffff
#define EXTMEM_CORE1_IBUS_VADDR_S  0

/* EXTMEM_CACHE_MMU_FAULT_CONTENT_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_MMU_FAULT_CONTENT_REG (DR_REG_EXTMEM_BASE + 0x120)

/* EXTMEM_CACHE_MMU_FAULT_CODE : RO; bitpos: [19:16]; default: 0;
 * The right-most 3 bits are used to indicate the operations which cause mmu
 * fault occurrence. 0: default, 1: cpu miss, 2: preload miss, 3: writeback,
 * 4: cpu miss evict recovery address, 5: load miss evict recovery address,
 * 6: external dma tx, 7: external dma rx. The most significant bit is used
 * to indicate this operation occurs in which one icache.
 */

#define EXTMEM_CACHE_MMU_FAULT_CODE    0x0000000f
#define EXTMEM_CACHE_MMU_FAULT_CODE_M  (EXTMEM_CACHE_MMU_FAULT_CODE_V << EXTMEM_CACHE_MMU_FAULT_CODE_S)
#define EXTMEM_CACHE_MMU_FAULT_CODE_V  0x0000000f
#define EXTMEM_CACHE_MMU_FAULT_CODE_S  16

/* EXTMEM_CACHE_MMU_FAULT_CONTENT : RO; bitpos: [15:0]; default: 0;
 * The bits are used to indicate the content of mmu entry which cause mmu
 * fault..
 */

#define EXTMEM_CACHE_MMU_FAULT_CONTENT    0x0000ffff
#define EXTMEM_CACHE_MMU_FAULT_CONTENT_M  (EXTMEM_CACHE_MMU_FAULT_CONTENT_V << EXTMEM_CACHE_MMU_FAULT_CONTENT_S)
#define EXTMEM_CACHE_MMU_FAULT_CONTENT_V  0x0000ffff
#define EXTMEM_CACHE_MMU_FAULT_CONTENT_S  0

/* EXTMEM_CACHE_MMU_FAULT_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_MMU_FAULT_VADDR_REG (DR_REG_EXTMEM_BASE + 0x124)

/* EXTMEM_CACHE_MMU_FAULT_VADDR : RO; bitpos: [31:0]; default: 0;
 * The bits are used to indicate the virtual address which cause mmu fault..
 */

#define EXTMEM_CACHE_MMU_FAULT_VADDR    0xffffffff
#define EXTMEM_CACHE_MMU_FAULT_VADDR_M  (EXTMEM_CACHE_MMU_FAULT_VADDR_V << EXTMEM_CACHE_MMU_FAULT_VADDR_S)
#define EXTMEM_CACHE_MMU_FAULT_VADDR_V  0xffffffff
#define EXTMEM_CACHE_MMU_FAULT_VADDR_S  0

/* EXTMEM_CACHE_WRAP_AROUND_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_WRAP_AROUND_CTRL_REG (DR_REG_EXTMEM_BASE + 0x128)

/* EXTMEM_CACHE_SRAM_RD_WRAP_AROUND : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable wrap around mode when read data from spiram.
 */

#define EXTMEM_CACHE_SRAM_RD_WRAP_AROUND    (BIT(1))
#define EXTMEM_CACHE_SRAM_RD_WRAP_AROUND_M  (EXTMEM_CACHE_SRAM_RD_WRAP_AROUND_V << EXTMEM_CACHE_SRAM_RD_WRAP_AROUND_S)
#define EXTMEM_CACHE_SRAM_RD_WRAP_AROUND_V  0x00000001
#define EXTMEM_CACHE_SRAM_RD_WRAP_AROUND_S  1

/* EXTMEM_CACHE_FLASH_WRAP_AROUND : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable wrap around mode when read data from flash.
 */

#define EXTMEM_CACHE_FLASH_WRAP_AROUND    (BIT(0))
#define EXTMEM_CACHE_FLASH_WRAP_AROUND_M  (EXTMEM_CACHE_FLASH_WRAP_AROUND_V << EXTMEM_CACHE_FLASH_WRAP_AROUND_S)
#define EXTMEM_CACHE_FLASH_WRAP_AROUND_V  0x00000001
#define EXTMEM_CACHE_FLASH_WRAP_AROUND_S  0

/* EXTMEM_CACHE_MMU_POWER_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_MMU_POWER_CTRL_REG (DR_REG_EXTMEM_BASE + 0x12c)

/* EXTMEM_CACHE_MMU_MEM_FORCE_PU : R/W; bitpos: [2]; default: 1;
 * The bit is used to power mmu memory down, 0: follow_rtc_lslp_pd, 1: power
 * up
 */

#define EXTMEM_CACHE_MMU_MEM_FORCE_PU    (BIT(2))
#define EXTMEM_CACHE_MMU_MEM_FORCE_PU_M  (EXTMEM_CACHE_MMU_MEM_FORCE_PU_V << EXTMEM_CACHE_MMU_MEM_FORCE_PU_S)
#define EXTMEM_CACHE_MMU_MEM_FORCE_PU_V  0x00000001
#define EXTMEM_CACHE_MMU_MEM_FORCE_PU_S  2

/* EXTMEM_CACHE_MMU_MEM_FORCE_PD : R/W; bitpos: [1]; default: 0;
 * The bit is used to power mmu memory down, 0: follow_rtc_lslp_pd, 1: power
 * down
 */

#define EXTMEM_CACHE_MMU_MEM_FORCE_PD    (BIT(1))
#define EXTMEM_CACHE_MMU_MEM_FORCE_PD_M  (EXTMEM_CACHE_MMU_MEM_FORCE_PD_V << EXTMEM_CACHE_MMU_MEM_FORCE_PD_S)
#define EXTMEM_CACHE_MMU_MEM_FORCE_PD_V  0x00000001
#define EXTMEM_CACHE_MMU_MEM_FORCE_PD_S  1

/* EXTMEM_CACHE_MMU_MEM_FORCE_ON : R/W; bitpos: [0]; default: 1;
 * The bit is used to enable clock gating to save power when access mmu
 * memory, 0: enable, 1: disable
 */

#define EXTMEM_CACHE_MMU_MEM_FORCE_ON    (BIT(0))
#define EXTMEM_CACHE_MMU_MEM_FORCE_ON_M  (EXTMEM_CACHE_MMU_MEM_FORCE_ON_V << EXTMEM_CACHE_MMU_MEM_FORCE_ON_S)
#define EXTMEM_CACHE_MMU_MEM_FORCE_ON_V  0x00000001
#define EXTMEM_CACHE_MMU_MEM_FORCE_ON_S  0

/* EXTMEM_CACHE_STATE_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_STATE_REG (DR_REG_EXTMEM_BASE + 0x130)

/* EXTMEM_DCACHE_STATE : RO; bitpos: [23:12]; default: 0;
 * The bit is used to indicate whether dcache main fsm is in idle state or
 * not. 1: in idle state,  0: not in idle state
 */

#define EXTMEM_DCACHE_STATE    0x00000fff
#define EXTMEM_DCACHE_STATE_M  (EXTMEM_DCACHE_STATE_V << EXTMEM_DCACHE_STATE_S)
#define EXTMEM_DCACHE_STATE_V  0x00000fff
#define EXTMEM_DCACHE_STATE_S  12

/* EXTMEM_ICACHE_STATE : RO; bitpos: [11:0]; default: 0;
 * The bit is used to indicate whether  icache main fsm is in idle state or
 * not. 1: in idle state,  0: not in idle state
 */

#define EXTMEM_ICACHE_STATE    0x00000fff
#define EXTMEM_ICACHE_STATE_M  (EXTMEM_ICACHE_STATE_V << EXTMEM_ICACHE_STATE_S)
#define EXTMEM_ICACHE_STATE_V  0x00000fff
#define EXTMEM_ICACHE_STATE_S  0

/* EXTMEM_CACHE_ENCRYPT_DECRYPT_RECORD_DISABLE_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ENCRYPT_DECRYPT_RECORD_DISABLE_REG (DR_REG_EXTMEM_BASE + 0x134)

/* EXTMEM_RECORD_DISABLE_G0CB_DECRYPT : R/W; bitpos: [1]; default: 0;
 * Reserved
 */

#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT    (BIT(1))
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_M  (EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_V << EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_S)
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_V  0x00000001
#define EXTMEM_RECORD_DISABLE_G0CB_DECRYPT_S  1

