apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_RECORD_DISABLE_DB_ENCRYPT : R/W; bitpos: [0]; default: 0;
 * Reserved
 */

#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT    (BIT(0))
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_M  (EXTMEM_RECORD_DISABLE_DB_ENCRYPT_V << EXTMEM_RECORD_DISABLE_DB_ENCRYPT_S)
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_V  0x00000001
#define EXTMEM_RECORD_DISABLE_DB_ENCRYPT_S  0

/* EXTMEM_CACHE_ENCRYPT_DECRYPT_CLK_FORCE_ON_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_ENCRYPT_DECRYPT_CLK_FORCE_ON_REG (DR_REG_EXTMEM_BASE + 0x138)

/* EXTMEM_CLK_FORCE_ON_CRYPT : R/W; bitpos: [2]; default: 1;
 * The bit is used to close clock gating of external memory encrypt and
 * decrypt clock. 1: close gating, 0: open clock gating.
 */

#define EXTMEM_CLK_FORCE_ON_CRYPT    (BIT(2))
#define EXTMEM_CLK_FORCE_ON_CRYPT_M  (EXTMEM_CLK_FORCE_ON_CRYPT_V << EXTMEM_CLK_FORCE_ON_CRYPT_S)
#define EXTMEM_CLK_FORCE_ON_CRYPT_V  0x00000001
#define EXTMEM_CLK_FORCE_ON_CRYPT_S  2

/* EXTMEM_CLK_FORCE_ON_AUTO_CRYPT : R/W; bitpos: [1]; default: 1;
 * The bit is used to close clock gating of automatic crypt clock. 1: close
 * gating, 0: open clock gating.
 */

#define EXTMEM_CLK_FORCE_ON_AUTO_CRYPT    (BIT(1))
#define EXTMEM_CLK_FORCE_ON_AUTO_CRYPT_M  (EXTMEM_CLK_FORCE_ON_AUTO_CRYPT_V << EXTMEM_CLK_FORCE_ON_AUTO_CRYPT_S)
#define EXTMEM_CLK_FORCE_ON_AUTO_CRYPT_V  0x00000001
#define EXTMEM_CLK_FORCE_ON_AUTO_CRYPT_S  1

/* EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT : R/W; bitpos: [0]; default: 1;
 * The bit is used to close clock gating of manual crypt clock. 1: close
 * gating, 0: open clock gating.
 */

#define EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT    (BIT(0))
#define EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT_M  (EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT_V << EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT_S)
#define EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT_V  0x00000001
#define EXTMEM_CLK_FORCE_ON_MANUAL_CRYPT_S  0

/* EXTMEM_CACHE_BRIDGE_ARBITER_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_BRIDGE_ARBITER_CTRL_REG (DR_REG_EXTMEM_BASE + 0x13c)

/* EXTMEM_ALLOC_WB_HOLD_ARBITER : R/W; bitpos: [0]; default: 0;
 * Reserved
 */

#define EXTMEM_ALLOC_WB_HOLD_ARBITER    (BIT(0))
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_M  (EXTMEM_ALLOC_WB_HOLD_ARBITER_V << EXTMEM_ALLOC_WB_HOLD_ARBITER_S)
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_V  0x00000001
#define EXTMEM_ALLOC_WB_HOLD_ARBITER_S  0

/* EXTMEM_CACHE_PRELOAD_INT_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_PRELOAD_INT_CTRL_REG (DR_REG_EXTMEM_BASE + 0x140)

/* EXTMEM_DCACHE_PRELOAD_INT_CLR : WOD; bitpos: [5]; default: 0;
 * The bit is used to clear the interrupt by dcache pre-load done.
 */

#define EXTMEM_DCACHE_PRELOAD_INT_CLR    (BIT(5))
#define EXTMEM_DCACHE_PRELOAD_INT_CLR_M  (EXTMEM_DCACHE_PRELOAD_INT_CLR_V << EXTMEM_DCACHE_PRELOAD_INT_CLR_S)
#define EXTMEM_DCACHE_PRELOAD_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_INT_CLR_S  5

/* EXTMEM_DCACHE_PRELOAD_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The bit is used to enable the interrupt by dcache pre-load done.
 */

#define EXTMEM_DCACHE_PRELOAD_INT_ENA    (BIT(4))
#define EXTMEM_DCACHE_PRELOAD_INT_ENA_M  (EXTMEM_DCACHE_PRELOAD_INT_ENA_V << EXTMEM_DCACHE_PRELOAD_INT_ENA_S)
#define EXTMEM_DCACHE_PRELOAD_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_INT_ENA_S  4

/* EXTMEM_DCACHE_PRELOAD_INT_ST : RO; bitpos: [3]; default: 0;
 * The bit is used to indicate the interrupt by dcache pre-load done.
 */

#define EXTMEM_DCACHE_PRELOAD_INT_ST    (BIT(3))
#define EXTMEM_DCACHE_PRELOAD_INT_ST_M  (EXTMEM_DCACHE_PRELOAD_INT_ST_V << EXTMEM_DCACHE_PRELOAD_INT_ST_S)
#define EXTMEM_DCACHE_PRELOAD_INT_ST_V  0x00000001
#define EXTMEM_DCACHE_PRELOAD_INT_ST_S  3

/* EXTMEM_ICACHE_PRELOAD_INT_CLR : WOD; bitpos: [2]; default: 0;
 * The bit is used to clear the interrupt by  icache pre-load done.
 */

#define EXTMEM_ICACHE_PRELOAD_INT_CLR    (BIT(2))
#define EXTMEM_ICACHE_PRELOAD_INT_CLR_M  (EXTMEM_ICACHE_PRELOAD_INT_CLR_V << EXTMEM_ICACHE_PRELOAD_INT_CLR_S)
#define EXTMEM_ICACHE_PRELOAD_INT_CLR_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_INT_CLR_S  2

/* EXTMEM_ICACHE_PRELOAD_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable the interrupt by  icache pre-load done.
 */

#define EXTMEM_ICACHE_PRELOAD_INT_ENA    (BIT(1))
#define EXTMEM_ICACHE_PRELOAD_INT_ENA_M  (EXTMEM_ICACHE_PRELOAD_INT_ENA_V << EXTMEM_ICACHE_PRELOAD_INT_ENA_S)
#define EXTMEM_ICACHE_PRELOAD_INT_ENA_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_INT_ENA_S  1

/* EXTMEM_ICACHE_PRELOAD_INT_ST : RO; bitpos: [0]; default: 0;
 * The bit is used to indicate the interrupt by  icache pre-load done.
 */

#define EXTMEM_ICACHE_PRELOAD_INT_ST    (BIT(0))
#define EXTMEM_ICACHE_PRELOAD_INT_ST_M  (EXTMEM_ICACHE_PRELOAD_INT_ST_V << EXTMEM_ICACHE_PRELOAD_INT_ST_S)
#define EXTMEM_ICACHE_PRELOAD_INT_ST_V  0x00000001
#define EXTMEM_ICACHE_PRELOAD_INT_ST_S  0

/* EXTMEM_CACHE_SYNC_INT_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_SYNC_INT_CTRL_REG (DR_REG_EXTMEM_BASE + 0x144)

/* EXTMEM_DCACHE_SYNC_INT_CLR : WOD; bitpos: [5]; default: 0;
 * The bit is used to clear the interrupt by dcache sync done.
 */

#define EXTMEM_DCACHE_SYNC_INT_CLR    (BIT(5))
#define EXTMEM_DCACHE_SYNC_INT_CLR_M  (EXTMEM_DCACHE_SYNC_INT_CLR_V << EXTMEM_DCACHE_SYNC_INT_CLR_S)
#define EXTMEM_DCACHE_SYNC_INT_CLR_V  0x00000001
#define EXTMEM_DCACHE_SYNC_INT_CLR_S  5

/* EXTMEM_DCACHE_SYNC_INT_ENA : R/W; bitpos: [4]; default: 0;
 * The bit is used to enable the interrupt by dcache sync done.
 */

#define EXTMEM_DCACHE_SYNC_INT_ENA    (BIT(4))
#define EXTMEM_DCACHE_SYNC_INT_ENA_M  (EXTMEM_DCACHE_SYNC_INT_ENA_V << EXTMEM_DCACHE_SYNC_INT_ENA_S)
#define EXTMEM_DCACHE_SYNC_INT_ENA_V  0x00000001
#define EXTMEM_DCACHE_SYNC_INT_ENA_S  4

/* EXTMEM_DCACHE_SYNC_INT_ST : RO; bitpos: [3]; default: 0;
 * The bit is used to indicate the interrupt by dcache sync done.
 */

#define EXTMEM_DCACHE_SYNC_INT_ST    (BIT(3))
#define EXTMEM_DCACHE_SYNC_INT_ST_M  (EXTMEM_DCACHE_SYNC_INT_ST_V << EXTMEM_DCACHE_SYNC_INT_ST_S)
#define EXTMEM_DCACHE_SYNC_INT_ST_V  0x00000001
#define EXTMEM_DCACHE_SYNC_INT_ST_S  3

