apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_ICACHE_SYNC_INT_CLR : WOD; bitpos: [2]; default: 0;
 * The bit is used to clear the interrupt by  icache sync done.
 */

#define EXTMEM_ICACHE_SYNC_INT_CLR    (BIT(2))
#define EXTMEM_ICACHE_SYNC_INT_CLR_M  (EXTMEM_ICACHE_SYNC_INT_CLR_V << EXTMEM_ICACHE_SYNC_INT_CLR_S)
#define EXTMEM_ICACHE_SYNC_INT_CLR_V  0x00000001
#define EXTMEM_ICACHE_SYNC_INT_CLR_S  2

/* EXTMEM_ICACHE_SYNC_INT_ENA : R/W; bitpos: [1]; default: 0;
 * The bit is used to enable the interrupt by  icache sync done.
 */

#define EXTMEM_ICACHE_SYNC_INT_ENA    (BIT(1))
#define EXTMEM_ICACHE_SYNC_INT_ENA_M  (EXTMEM_ICACHE_SYNC_INT_ENA_V << EXTMEM_ICACHE_SYNC_INT_ENA_S)
#define EXTMEM_ICACHE_SYNC_INT_ENA_V  0x00000001
#define EXTMEM_ICACHE_SYNC_INT_ENA_S  1

/* EXTMEM_ICACHE_SYNC_INT_ST : RO; bitpos: [0]; default: 0;
 * The bit is used to indicate the interrupt by  icache sync done.
 */

#define EXTMEM_ICACHE_SYNC_INT_ST    (BIT(0))
#define EXTMEM_ICACHE_SYNC_INT_ST_M  (EXTMEM_ICACHE_SYNC_INT_ST_V << EXTMEM_ICACHE_SYNC_INT_ST_S)
#define EXTMEM_ICACHE_SYNC_INT_ST_V  0x00000001
#define EXTMEM_ICACHE_SYNC_INT_ST_S  0

/* EXTMEM_CACHE_MMU_OWNER_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_MMU_OWNER_REG (DR_REG_EXTMEM_BASE + 0x148)

/* EXTMEM_CACHE_MMU_OWNER : R/W; bitpos: [23:0]; default: 0;
 * The bits are used to specify the owner of MMU.bit0: icache, bit1: dcache,
 * bit2: dma, bit3: reserved.
 */

#define EXTMEM_CACHE_MMU_OWNER    0x00ffffff
#define EXTMEM_CACHE_MMU_OWNER_M  (EXTMEM_CACHE_MMU_OWNER_V << EXTMEM_CACHE_MMU_OWNER_S)
#define EXTMEM_CACHE_MMU_OWNER_V  0x00ffffff
#define EXTMEM_CACHE_MMU_OWNER_S  0

/* EXTMEM_CACHE_CONF_MISC_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_CONF_MISC_REG (DR_REG_EXTMEM_BASE + 0x14c)

/* EXTMEM_CACHE_TRACE_ENA : R/W; bitpos: [2]; default: 1;
 * The bit is used to enable cache trace function.
 */

#define EXTMEM_CACHE_TRACE_ENA    (BIT(2))
#define EXTMEM_CACHE_TRACE_ENA_M  (EXTMEM_CACHE_TRACE_ENA_V << EXTMEM_CACHE_TRACE_ENA_S)
#define EXTMEM_CACHE_TRACE_ENA_V  0x00000001
#define EXTMEM_CACHE_TRACE_ENA_S  2

/* EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT : R/W; bitpos: [1]; default: 1;
 * The bit is used to disable checking mmu entry fault by sync operation.
 */

#define EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT    (BIT(1))
#define EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_M  (EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_V << EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_S)
#define EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_V  0x00000001
#define EXTMEM_CACHE_IGNORE_SYNC_MMU_ENTRY_FAULT_S  1

/* EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT : R/W; bitpos: [0]; default:
 * 1;
 * The bit is used to disable checking mmu entry fault by preload operation.
 */

#define EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT    (BIT(0))
#define EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_M  (EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_V << EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_S)
#define EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_V  0x00000001
#define EXTMEM_CACHE_IGNORE_PRELOAD_MMU_ENTRY_FAULT_S  0

/* EXTMEM_DCACHE_FREEZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_FREEZE_REG (DR_REG_EXTMEM_BASE + 0x150)

/* EXTMEM_DCACHE_FREEZE_DONE : RO; bitpos: [2]; default: 1;
 * The bit is used to indicate dcache freeze success
 */

#define EXTMEM_DCACHE_FREEZE_DONE    (BIT(2))
#define EXTMEM_DCACHE_FREEZE_DONE_M  (EXTMEM_DCACHE_FREEZE_DONE_V << EXTMEM_DCACHE_FREEZE_DONE_S)
#define EXTMEM_DCACHE_FREEZE_DONE_V  0x00000001
#define EXTMEM_DCACHE_FREEZE_DONE_S  2

/* EXTMEM_DCACHE_FREEZE_MODE : R/W; bitpos: [1]; default: 0;
 * The bit is used to configure freeze mode, 0:  assert busy if CPU miss 1:
 * assert hit if CPU miss
 */

#define EXTMEM_DCACHE_FREEZE_MODE    (BIT(1))
#define EXTMEM_DCACHE_FREEZE_MODE_M  (EXTMEM_DCACHE_FREEZE_MODE_V << EXTMEM_DCACHE_FREEZE_MODE_S)
#define EXTMEM_DCACHE_FREEZE_MODE_V  0x00000001
#define EXTMEM_DCACHE_FREEZE_MODE_S  1

/* EXTMEM_DCACHE_FREEZE_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable dcache freeze mode
 */

#define EXTMEM_DCACHE_FREEZE_ENA    (BIT(0))
#define EXTMEM_DCACHE_FREEZE_ENA_M  (EXTMEM_DCACHE_FREEZE_ENA_V << EXTMEM_DCACHE_FREEZE_ENA_S)
#define EXTMEM_DCACHE_FREEZE_ENA_V  0x00000001
#define EXTMEM_DCACHE_FREEZE_ENA_S  0

/* EXTMEM_ICACHE_FREEZE_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_FREEZE_REG (DR_REG_EXTMEM_BASE + 0x154)

/* EXTMEM_ICACHE_FREEZE_DONE : RO; bitpos: [2]; default: 1;
 * The bit is used to indicate icache freeze success
 */

#define EXTMEM_ICACHE_FREEZE_DONE    (BIT(2))
#define EXTMEM_ICACHE_FREEZE_DONE_M  (EXTMEM_ICACHE_FREEZE_DONE_V << EXTMEM_ICACHE_FREEZE_DONE_S)
#define EXTMEM_ICACHE_FREEZE_DONE_V  0x00000001
#define EXTMEM_ICACHE_FREEZE_DONE_S  2

/* EXTMEM_ICACHE_FREEZE_MODE : R/W; bitpos: [1]; default: 0;
 * The bit is used to configure freeze mode, 0:  assert busy if CPU miss 1:
 * assert hit if CPU miss
 */

#define EXTMEM_ICACHE_FREEZE_MODE    (BIT(1))
#define EXTMEM_ICACHE_FREEZE_MODE_M  (EXTMEM_ICACHE_FREEZE_MODE_V << EXTMEM_ICACHE_FREEZE_MODE_S)
#define EXTMEM_ICACHE_FREEZE_MODE_V  0x00000001
#define EXTMEM_ICACHE_FREEZE_MODE_S  1

/* EXTMEM_ICACHE_FREEZE_ENA : R/W; bitpos: [0]; default: 0;
 * The bit is used to enable icache freeze mode
 */

#define EXTMEM_ICACHE_FREEZE_ENA    (BIT(0))
#define EXTMEM_ICACHE_FREEZE_ENA_M  (EXTMEM_ICACHE_FREEZE_ENA_V << EXTMEM_ICACHE_FREEZE_ENA_S)
#define EXTMEM_ICACHE_FREEZE_ENA_V  0x00000001
#define EXTMEM_ICACHE_FREEZE_ENA_S  0

/* EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_REG register
 * ******* Description ***********
 */

#define EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_REG (DR_REG_EXTMEM_BASE + 0x158)

/* EXTMEM_ICACHE_ATOMIC_OPERATE_ENA : R/W; bitpos: [0]; default: 1;
 * The bit is used to activate icache atomic operation protection. In this
 * case, sync/lock operation can not interrupt miss-work. This feature does
 * not work during invalidateAll operation.
 */

#define EXTMEM_ICACHE_ATOMIC_OPERATE_ENA    (BIT(0))
#define EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_M  (EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_V << EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_S)
#define EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_V  0x00000001
#define EXTMEM_ICACHE_ATOMIC_OPERATE_ENA_S  0

/* EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_REG register
 * ******* Description ***********
 */

#define EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_REG (DR_REG_EXTMEM_BASE + 0x15c)

/* EXTMEM_DCACHE_ATOMIC_OPERATE_ENA : R/W; bitpos: [0]; default: 1;
 * The bit is used to activate dcache atomic operation protection. In this
 * case, sync/lock/occupy operation can not interrupt miss-work. This
 * feature does not work during invalidateAll operation.
 */

#define EXTMEM_DCACHE_ATOMIC_OPERATE_ENA    (BIT(0))
#define EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_M  (EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_V << EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_S)
#define EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_V  0x00000001
#define EXTMEM_DCACHE_ATOMIC_OPERATE_ENA_S  0

