apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_extmem.h
/* EXTMEM_CACHE_REQUEST_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_REQUEST_REG (DR_REG_EXTMEM_BASE + 0x160)

/* EXTMEM_CACHE_REQUEST_BYPASS : R/W; bitpos: [0]; default: 0;
 * The bit is used to disable request recording which could cause
 * performance issue
 */

#define EXTMEM_CACHE_REQUEST_BYPASS    (BIT(0))
#define EXTMEM_CACHE_REQUEST_BYPASS_M  (EXTMEM_CACHE_REQUEST_BYPASS_V << EXTMEM_CACHE_REQUEST_BYPASS_S)
#define EXTMEM_CACHE_REQUEST_BYPASS_V  0x00000001
#define EXTMEM_CACHE_REQUEST_BYPASS_S  0

/* EXTMEM_CLOCK_GATE_REG register
 * ******* Description ***********
 */

#define EXTMEM_CLOCK_GATE_REG (DR_REG_EXTMEM_BASE + 0x164)

/* EXTMEM_CLK_EN : R/W; bitpos: [0]; default: 1;
 * Reserved
 */

#define EXTMEM_CLK_EN    (BIT(0))
#define EXTMEM_CLK_EN_M  (EXTMEM_CLK_EN_V << EXTMEM_CLK_EN_S)
#define EXTMEM_CLK_EN_V  0x00000001
#define EXTMEM_CLK_EN_S  0

/* EXTMEM_CACHE_TAG_OBJECT_CTRL_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_TAG_OBJECT_CTRL_REG (DR_REG_EXTMEM_BASE + 0x180)

/* EXTMEM_DCACHE_TAG_OBJECT : R/W; bitpos: [1]; default: 0;
 * Set this bit to set dcache tag memory as object. This bit should be
 * onehot with the others fields inside this register.
 */

#define EXTMEM_DCACHE_TAG_OBJECT    (BIT(1))
#define EXTMEM_DCACHE_TAG_OBJECT_M  (EXTMEM_DCACHE_TAG_OBJECT_V << EXTMEM_DCACHE_TAG_OBJECT_S)
#define EXTMEM_DCACHE_TAG_OBJECT_V  0x00000001
#define EXTMEM_DCACHE_TAG_OBJECT_S  1

/* EXTMEM_ICACHE_TAG_OBJECT : R/W; bitpos: [0]; default: 0;
 * Set this bit to set icache tag memory as object. This bit should be
 * onehot with the others fields inside this register.
 */

#define EXTMEM_ICACHE_TAG_OBJECT    (BIT(0))
#define EXTMEM_ICACHE_TAG_OBJECT_M  (EXTMEM_ICACHE_TAG_OBJECT_V << EXTMEM_ICACHE_TAG_OBJECT_S)
#define EXTMEM_ICACHE_TAG_OBJECT_V  0x00000001
#define EXTMEM_ICACHE_TAG_OBJECT_S  0

/* EXTMEM_CACHE_TAG_WAY_OBJECT_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_TAG_WAY_OBJECT_REG (DR_REG_EXTMEM_BASE + 0x184)

/* EXTMEM_CACHE_TAG_WAY_OBJECT : R/W; bitpos: [2:0]; default: 0;
 * Set this bits to select which way of the tag-object will be accessed. 0:
 * way0, 1: way1, 2: way2, 3: way3, .., 7: way7.
 */

#define EXTMEM_CACHE_TAG_WAY_OBJECT    0x00000007
#define EXTMEM_CACHE_TAG_WAY_OBJECT_M  (EXTMEM_CACHE_TAG_WAY_OBJECT_V << EXTMEM_CACHE_TAG_WAY_OBJECT_S)
#define EXTMEM_CACHE_TAG_WAY_OBJECT_V  0x00000007
#define EXTMEM_CACHE_TAG_WAY_OBJECT_S  0

/* EXTMEM_CACHE_VADDR_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_VADDR_REG (DR_REG_EXTMEM_BASE + 0x188)

/* EXTMEM_CACHE_VADDR : R/W; bitpos: [31:0]; default: 0;
 * Those bits stores the virtual address which will decide where inside the
 * specified tag memory object will be accessed.
 */

#define EXTMEM_CACHE_VADDR    0xffffffff
#define EXTMEM_CACHE_VADDR_M  (EXTMEM_CACHE_VADDR_V << EXTMEM_CACHE_VADDR_S)
#define EXTMEM_CACHE_VADDR_V  0xffffffff
#define EXTMEM_CACHE_VADDR_S  0

/* EXTMEM_CACHE_TAG_CONTENT_REG register
 * ******* Description ***********
 */

#define EXTMEM_CACHE_TAG_CONTENT_REG (DR_REG_EXTMEM_BASE + 0x18c)

/* EXTMEM_CACHE_TAG_CONTENT : R/W; bitpos: [31:0]; default: 0;
 * This is a constant place where we can write data to or read data from the
 * tag memory on the specified cache.
 */

#define EXTMEM_CACHE_TAG_CONTENT    0xffffffff
#define EXTMEM_CACHE_TAG_CONTENT_M  (EXTMEM_CACHE_TAG_CONTENT_V << EXTMEM_CACHE_TAG_CONTENT_S)
#define EXTMEM_CACHE_TAG_CONTENT_V  0xffffffff
#define EXTMEM_CACHE_TAG_CONTENT_S  0

/* EXTMEM_DATE_REG register
 * ******* Description ***********
 */

#define EXTMEM_DATE_REG (DR_REG_EXTMEM_BASE + 0x3fc)

/* EXTMEM_DATE : R/W; bitpos: [27:0]; default: 33628944;
 * version information.
 */

#define EXTMEM_DATE    0x0fffffff
#define EXTMEM_DATE_M  (EXTMEM_DATE_V << EXTMEM_DATE_S)
#define EXTMEM_DATE_V  0x0fffffff
#define EXTMEM_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_EXTMEM_H */
